{
    "afritada":"<div class='ingredients'><h3>Ingredients</h3><br>¼ cup canola oil<br>2 medium potatoes, peeled and quartered<br>1 large carrot, peeled and cut into cubes<br>½ small red bell pepper, cored and sliced into ½-inch thick strips<br>½ small green bell pepper, cored and sliced into ½-inch thick strips<br>4 pounds chicken, cut into serving pieces<br>1 small onion, peeled and sliced thinly<br>3 cloves garlic, peeled and minced<br>6 large Roma tomatoes<br>1 tablespoon fish sauce<br>1 cup water<br>½ cup frozen sweet peas thawed<br>salt and pepper to taste</div><br><div class='instructions'><h3>Instructions</h3><br>1. In a pan over medium heat, heat oil.<br>2. Add potatoes and carrots and cook, turning once or twice, until lightly browned. Remove from pan and drain on paper towels.<br>3. Remove excess oil from pan except for about 2 tablespoons.<br>4. Add bell peppers and cook for about 30 to 45 seconds. Remove from pan and drain on paper towels.<br>5. Add onions and garlic and cook until softened.<br>6. Add chicken and cook, turning on sides once or twice, until lightly browned but not cooked through.<br>7. Add tomatoes and cook, mashing regularly with back spoon until softened and release juices.<br>8. Add fish sauce and cook for about 1 to 2 minutes.<br>9. Add water and bring to a boil.<br>10. Lower heat, cover, and cook for about 20 to 30 minutes or until chicken is cooked through and sauce is thickened to desired consistency.<br>11. Add potatoes and carrots and continue to cook until fork-tender.<br>12. Add bell peppers and sweet peas. Cook for 1 to 2 minutes or until green peas are heated through and bell peppers are tender yet crisp.<br>13. Season with salt and pepper to taste. Serve hot.</div><br><div class='nutritionalfacts'><br><h3>Nutritional Facts - Afritada (Tuna)</h3><br>1. Calories - 60<br>2. Total Fat - 3.00g | 4%<br>3. Saturated Fat - 1.500g | 8%<br>4. Trans Fat - 0.000g<br>5. Cholestero - l0mg | 0%<br>6. Sodium - 380mg 17%<br>7. Total Carbohydrate - 4.00g | 1%<br>8. Dietary Fiber - 1.0g | 4%<br>9. Sugars - 3.00g<br>10. Protein - 5.00g<br><h3>Nutrition Facts - Chicken Afritada</h3><br>1. Energy - 2309 kj | 552 kcal<br>2. Fat - 21.09g<br>3. Saturated Fat- 4.041g<br>4. Trans Fat - 0.083g<br>5. Monounsaturated Fat - 9.531g<br>6. Polyunsaturated Fat - 5.597g<br>7. Carbohydrates - 56.44g<br>8. Sugar - 7.08g<br>9. Fibre - 7g<br>10. Protein - 34.33g<br>11. Sodium - 1398mg<br>12. Cholestero - l117mg<br>13. Potassium - 1325mg</div><br><div class='dietary'><br><h3>Dietary Recommendation</h3><br>After enjoying afritada, balance your meals by including a variety of lean proteins, whole grains, and plenty of fruits and vegetables throughout the day. For example, start with oatmeal and fruit for breakfast, have a fresh fruit and nuts snack, and finish with a dinner of grilled fish or tofu, steamed vegetables, and whole grains. Stay hydrated, practice portion control, and incorporate physical activity to maintain overall health.<br><br><a href='https://www.kawalingpinoy.com/chicken-afritada'>Source</a></div>",
    "arroz_caldo":"<div class='ingredients'><h3>Ingredients</h3><br>1 ½ lbs chicken cut into serving pieces<br>1 ½ cups rice uncooked<br>34 ounces water about 1 liter<br>2 Tablespoons fish sauce<br>1 teaspoon garlic<br>1/4 teaspoon ground black pepper<br>1 cup onion minced<br>4 eggs hard boiled<br>1 cup scallions green onions, minced<br>2 knobs ginger julienned<br>3 tbsp safflower kasubha<br>1 chicken cube bouillon<br>1 lemon or 4 pieces calamansi<br>2 Tablespoon cooking oil</div><br><div class='instructions'><h3>Instructions</h3><br>1. In a pot, heat the cooking oil then saute the garlic, onion, and ginger<br>2. Dash-in some ground black pepper<br>3. Add the chicken cube and cook until the cube melts<br>3. Put-in the chicken and cook until outer layer color turns golden brown<br>4. Add the fish sauce and uncooked rice then mix and cook for a few minutes<br>5. Pour-in the water and bring to a boil<br>6. Stir occasionally and simmer until the rice is fully cooked (about 30 to 40 minutes)<br>7. Put-in the hard boiled eggs<br>8. Add the safflower for additional color and aroma<br>9. Serve hot with garlic, minced scallions, and lemon.</div><br><div class='nutritionalfacts'><br><h3>Nutrition Facts - Arroz Caldo</h3><br>1. Calories - 91cals<br>2. Total Fat - 1g | 1%<br>3. Saturated Fat - 0.4g | 2%<br>4. Total Carbs - 12g | 4%<br>5. Net Carbs - 11g<br>6. Dietary Fiber - 1g | 4%<br>7. Total Sugars - 1g<br>8. Protein - 8g | 17%<br>9. Cholesterol - 15mg | 5%<br>10. Sodium - 21mg | 1% </div><br><div class='dietary'><br><h3>Dietary Recommendation</h3><br>After eating arroz caldo, maintain a balanced diet by including lean proteins, whole grains, and plenty of vegetables in your other meals. For instance, have a mixed vegetable and chicken salad for lunch, snack on Greek yogurt and berries, and enjoy a dinner of grilled salmon, quinoa, and steamed greens. Ensure you stay hydrated and engage in regular physical activity for overall well-being.<br><br><a href='https://panlasangpinoy.com/arroz-caldo'>Source</a></div>",
    "bagnet":"<div class='ingredients'><h3>Ingredients</h3><br>2 to 2 1/2 lbs. whole pork belly<br>1 medium red onion<br>1 tablespoon whole black peppercorn<br>1 1/2 tablespoons salt<br>6 cloves crushed garlic<br>4 to 6 cups water<br>3 cups cooking oil</div><br><div class='instructions'><h3>Instructions</h3><br>1. Arrange the pork belly in a wide and deep cooking pot. Pour-in the water. Make sure that the pork belly is fully submerged in water. Let boil.<br>2. Once the water starts to boil, add the garlic, onion, 1 tablespoon salt, and whole black peppercorn. Simmer for 30 to 40 minutes.<br>3. Remove the boiled pork belly from the cooking pot and place in a plate. Let it cool to room temperature.<br>4. Rub the remaining 1/2 tablespoon of salt all over the boiled pork belly. Let is stay for 10 to 20 minutes.<br>5. Heat the cooking oil in a deep cooking pot. When the oil gets hot, gently put-in the pork belly and deep-fry in medium heat until the pork belly turns golden brown and the texture gets crispy. The oil will splatter during this process, so be careful.Make sure that you do not cover the cooking pot completely while deep frying. You can put a splatter guard on top of the cooking pot to control the oil.<br>6. Once the pork belly is golden brown and crispy, remove it from the cooking pot and arrange in a plate lined with paper towel. Turn the stove off and let the pork belly cool down to room temperature.<br>7. When the pork belly cools down, heat-up the oil on more time. Deep fry the same pork belly for the second time in medium heat for 5 to 10 minutes or until it gets extra crispy.<br>8. Remove from the cooking pot and place in a plate lined with paper towel. Let the towel absorb the excess oil.<br>9. Slice the pork bagnet into serving pieces and serve with bagoong monamon (also known as bugguong munamon) or even guinamos or bagoong Balayan. Note: you can squeeze lemon or calamansi on the bagoong to make it taste better.</div><br><div class='nutritionalfacts'><br><h3>Nutrition Facts - Bagnet</h3><br>1. Carbs - 32g<br>2. Dietary Fiber - 2g<br>3. Sugars - 0g<br>4. Fat - 2.5g<br>5. Saturated - 0g<br>6. Polyunsaturated - 0g<br>7. Monounsaturated - 0g<br>8. Trans - 0g<br>9. Protein - 7g<br>10. Sodium - 10mg<br>11. Potassium - 0mg<br>12. Cholesterol - 0mg <br>13. Vitamin A - 0%  <br>14. Vitamin C - 0% <br>15. Calcium - 2% <br>16. Iron- 15% <div class='dietary'><br><h3>Dietary Recommendation</h3><br>After indulging in bagnet, a crispy and fatty pork belly dish, it's advisable to balance your diet with nutrient-dense foods that can aid digestion and provide essential vitamins and minerals. A recommended dietary plan would include incorporating plenty of fibrous vegetables, lean proteins, and hydrating fluids. For example, a meal consisting of grilled fish or chicken, steamed broccoli, and a side of brown rice can help restore nutritional balance while promoting healthy digestion.<br><br><br><a href='https://panlasangpinoy.com/bagnet-recipe/'>Source</a></div>",
    "balut":"<div class='ingredients'><h3>Ingredients</h3><br>Eight thick-shelled eggs<br>1 cup palay rice (unhusked rice)</div><br><div class='instructions'><h3>Instructions</h3><br>1. Select duck or chicken eggs by tapping the eggs with your fingers to pull out cracked or thin-shelled eggs (Eggs with cracks have a hollow sound while thin-shelled have a brittle sound).<br>2. Only eggs with thick shells are used to make balut because they can resist the strain of being placed and removed from cylindrical baskets known as “toong.” This measure is 34 inches high by 21 inches in diameter and is open on both ends, and ricehulls are placed in the surrounding gaps to a height of 4 inches from the brim. Balut should ideally be created using eggs no more than five days old.<br>3. Roast or heat palay to a temperature of 107 °F or 430 °C in an iron vat or cauldron. Remove the palay when you can hold it in your hands.<br>4. Eggs are then placed in the toong, alternating with heated palay bags. The number of wild palay bags is 1 for every egg bag. Put two heated palay bags on the bottom and two on the top to ensure heat conservation. For every toong containing tenlayers of eggs, you would need 13 bags of roasted palay.<br>5. Each toong can hold ten bags. Cover with just sacks to conserve heat further. Candling is the process of having eggs against the hole of a lighted box in a dark room to separate infertile eggs from fertile ones. Infertile eggs are called penny;these are also boiled like balut but fetch a lower price.</div><br><div class='nutritionalfacts'><br><h3>Nutrition Facts - Balut</h3><br>1.Calories- 129<br>2. Total Fat - 9.6g | 12%<br>3. Saturated Fat - 2.566g | 13%<br>4. Trans Fat - 0g<br>5. Saturated - 0g<br>6. Polyunsaturated Fat - 0.853g<br>7. Monounsaturated Fat - 4.549g<br>8. Cholesterol - 616mg | 205%<br>9. Sodium - 210mg | 9%<br>10. Total Carbohydrate - 1.01g | 0%<br>11. Dietary Fiber - 0g | 0%<br>12. Protein - 8.93g<br>13. Vitamin D - 0%  <br>14. Calcium - 45mg | 3% <br>15. Iron - 2.69mg | 15%<br>16. Potassium - 155mg | 3%<br>17. Vitamin A - 135mcg | 15%<br>18. Vitamin C - 0mg | 0%</div><br><div class='dietary'><br><h3>Dietary Recommendation</h3><br>After consuming balut, a fertilized duck egg delicacy, it's recommended to focus on a lighter, more easily digestible diet for the next few meals. Incorporate plenty of fresh fruits and vegetables, which provide essential vitamins, minerals, and fiber to aid digestion. Lean proteins like grilled chicken or fish, along with whole grains, can help restore balanced nutrition. Staying hydrated by drinking water or herbal teas can also support the body's digestive processes following the rich balut dish.<br><br><a href='https://cullyskitchen.com/how-to-cook-balut'>Source</a></div>",
    "bibimbap":"<div class='ingredients'><h3>Ingredients</h3><br>3/4 cup short-grain brown or white rice, rinsed (soaking for 12-24 hours to speed cooking is optional*)<br>1 ½ cups water (if rice was soaked, reduce water by about 1/4 cup (60 ml) as recipe is written)<br>1 pinch sea salt<br>2-3 Tbsp sesame oil, DIVIDED (toasted for more flavor, untoasted works, too*)<br>3 cups packed mixed vegetables (such as finely shredded carrot, thinly sliced zucchini, or spinach)<br>1 heaping cup bean sprouts (if you can't find, sub more mixed vegetables)<br>2 stalks green onion, sliced on an angle<br>2 cloves garlic, minced<br>2 Tbsp coconut aminos, DIVIDED (or sub tamari to taste, or sea salt)<br>2 large eggs* (we recommend organic, pasture-raised, and as ethically sourced as possible, such as Vital Farms)</div><br><div class='instructions'><h3>Instructions</h3><br>1. Optional: If soaking rice, rinse, drain, and add to a mixing bowl and cover with cool water. Soak for 12 hours or overnight. For a quicker soak, cover in hot water for 1 hour. Then rinse and drain.<br>2. To a medium saucepan, add cooking water (if you soaked your rice, start with 1 ¼ cups water as recipe is written), rinsed rice, and salt. Heat over high heat and bring to a boil, reduce heat to simmer, and cover. Cook for 15-20 minutes or untilwater is absorbed and rice is tender and fluffy. Soaked rice generally takes less time to cook. Unsoaked rice can take up to 30 minutes or more. Keep covered and set aside.<br>3. In the meantime, prepare Gochujang sauce. Skip if using store-bought.<br>4. While the rice finishes cooking, heat a large skillet over medium heat (stainless steel or cast iron are best). Once hot, add 1 tsp of sesame oil or enough to just coat the pan.<br>5. Once the oil is hot, add vegetables one type at a time and cook in batches until lightly browned (1-2 minutes), seasoning each with a little minced garlic and a dash of coconut aminos, tamari, or sea salt. Cooking in batches allows you to arrangevegetables separately over the rice for visual effect. We cooked the zucchini first, then carrots, green onion, bean sprouts, and spinach. Add more oil to the pan as needed between vegetables.<br>6. Arrange cooked vegetables in individual piles on a serving plate and cover gently to keep warm until serving.<br>7. To cook eggs (if vegan, see notes for options!), heat the same pan over medium heat. Once hot, add a little more oil (sesame or otherwise), and carefully crack eggs. For sunny-side up (our preference), cover briefly with a lid to steam for 1 minute,then remove lid and continue cooking until whites are cooked but yolks are still runny. Turn off heat and set aside (uncovered).<br>8. To serve, divide desired amount of rice between serving bowls (see notes for traditional dolsot recommendations and crispy rice hacks!) and top with portions of cooked veggies and egg.<br>9. Serve with 1-2 Tbsp Gochujang, kimchi (optional), and a dash of sesame seeds (optional). Bibimbap means “mixed rice,” so once your egg and Gochujang sauce are added, use a spoon or your chopsticks to stir everything together and mix the flavors.Then enjoy!<br>10. This dish is best fresh, but leftovers can be stored in the refrigerator up to 2 days and be reheated on the stovetop over medium heat as a stir fry. Not freezer-friendly.</div><br><div class='nutritionalfacts'><br><h3>Nutrition Facts - Bibimbap</h3><br>1.Calories- 634<br>2. Total Fat - 19.68g | 25%<br>3. Saturated Fat - 4.18g | 21%<br>4. Trans Fat - 0g<br>5. Polyunsaturated Fat - 4.41g<br>6. Monounsaturated Fat - 9.441g<br>7. Cholesterol - 126mg | 42%<br>8. Sodium - 376mg | 16%<br>9. Total Carbohydrate - 88.26g | 32%<br>10. Dietary Fiber - 2.9g | 10%<br>11. Sugars - 2.12g<br>12. Protein - 24.16g<br>13. Vitamin D - 1mcg | 4% <br>14. Calcium - 78mg | 6%<br>15. Iron - 2.97mg | 17%<br>16. Potassium - 509mg | 11%<br>17. Vitamin A - 160mcg | 18%<br>18. Vitamin C - 8.7mg | 10%</div><br><div class='dietary'><br><h3>Dietary Recommendation</h3><br>After enjoying a hearty bibimbap, a Korean rice dish with various toppings like vegetables, gochujang (chili paste), and often beef or a fried egg, it's advisable to opt for a lighter, more plant-based diet for the next few meals. Focusing on fresh fruits, leafy greens, and other fibrous vegetables can help promote better digestion and provide essential nutrients. Incorporating fermented foods like kimchi can also aid gut health. Stay well-hydrated by drinking plenty of water or unsweetened beverages.<br><br><a href='https://minimalistbaker.com/easy-bibimbap-with-gochujang-sauce'>Source</a></div>",
    "bibingka":"<div class='ingredients'><h3>Ingredients</h3><br>1 cup rice flour<br>1/8 teaspoon salt<br>2 1/2 teaspoon baking powder<br>3 tablespoons butter<br>1/2 cup granulated sugar<br>1 cup coconut milk<br>1/4 cup fresh milk<br>1 piece salted duck egg sliced<br>1/2 cup grated cheese<br>3 pieces raw eggs<br>1/4 cup grated coconut<br>Pre-cut banana leaf</div><br><div class='instructions'><h3>Instructions</h3><br>1. Preheat oven to 375 degrees Fahrenheit.<br>2. Combine rice flour, baking powder, and salt then mix well. Set aside.<br>3. Cream butter then gradually put-in sugar while whisking.<br>4. Add the eggs then whisk until every ingredient is well incorporated.<br>5. Gradually add the rice flour, salt, and baking powder mixture then continue mixing.<br>6. Pour-in coconut milk and fresh milk then whisk some more for 1 to 2 minutes.<br>7. Arrange the pre-cut banana leaf on a cake pan or baking pan.<br>8. Pour the mixture on the pan.<br>9. Bake for 15 minutes.<br>10. Remove from the oven then top with sliced salted egg and grated cheese (do not turn the oven off).<br>11. Put back in the oven and bake for 15 to 20 minutes or until the color of the top turn medium brown.<br>12. Remove from the oven and let cool.<br>13. Brush with butter and top with grated coconut. Serve.</div><br><div class='nutritionalfacts'><br><h3>Nutrition Facts - Bibingka</h3><br>1. Calories - 734kcal<br>2. Carbohydrates - 83g, Sugar - 35g<br>3. Protein - 13g<br>4. Fat - 41g, Saturated Fat - 31g, Polyunsaturated Fat - 1g, Monounsaturated Fat - 7g, Trans Fat - 1g<br>5. Cholesterol - 110mg<br>6. Sodium - 361mg<br>7. Potassium - 652mg<br>8. Vitamin C - 1mg<br>9. Calcium - 336mg<br>10. Iron - 4mg</div><br><div class='dietary'><br><h3>Dietary Recommendation</h3><br>After indulging in bibingka, a rich and decadent Filipino rice cake, it's wise to balance your diet with lighter, more easily digestible foods for the next few meals. Incorporate plenty of fresh fruits and vegetables, which provide essential vitamins, minerals, and fiber to aid digestion. Lean proteins like grilled fish or chicken can help restore nutritional balance. Staying hydrated by drinking water or herbal teas can also support your body's digestive processes following the rich bibingka treat.<br><br><a href='https://panlasangpinoy.com/rice-cake-bibingka-recipe'>Source</a></div>",
    "bicol_express":"<div class='ingredients'><h3>Ingredients</h3><br>2 lbs. pork belly sliced into cubes<br>6 pieces siling pansigang slice<br>1 piece Knorr Pork Cube<br>4 cups coconut milk<br>2 cups coconut cream<br>2 pieces onion chopped<br>3 ½ tablespoons balaw or bagoong alamang<br>6 pieces Thai chili pepper chopped<br>3 thumbs ginger crushed<br>5 cloves garlic crushed</div><br><div class='instructions'><h3>Instructions</h3><br>1. Combine coconut milk, onion, ginger, garlic, and pork in a cooking pot. Stir. Turn the heat on and let the coconut milk boil. Cover the pot and continue to boil in medium heat until the liquid reduces to half. Note: Stir the mixture every 7 minutesto prevent lumps from forming.<br>2. Add balaw or bagoong alamang, chili peppers, coconut cream, and Knorr pork cube. Stir. Continue to boil until the coconut milk reduces to your desired consistency.<br>3. Transfer to a serving bowl. Serve.</div><br><div class='nutritionalfacts'><br><h3>Nutrition Facts - Bicol Express</h3><br>1.Energy - 1307 kj | 312 kcal<br>2. Protein - 21.45g<br>3. Fat - 19.55g<br>4. Saturated Fat - 9.983g<br>5. Polyunsaturated Fat - 2.084g<br>6. Monounsaturated Fat - 6.104g<br>7. Cholesterol - 66mg<br>8. Carbohydrates - 13.96g<br>9. Sugar - 5.56g<br>10. Fibre - 2.5g<br>11. Sodium - 85mg<br>12. Potassium - 649mg</div><br><div class='dietary'><br><h3>Dietary Recommendation</h3><br>After enjoying the flavorful and spicy Bicol Express dish, which typically contains pork, coconut milk, and chili peppers, it's advisable to opt for a lighter and more easily digestible diet for your next few meals. Incorporate plenty of fresh vegetables, leafy greens, and fruits to provide essential nutrients, fiber, and antioxidants that can aid digestion. Lean protein sources like grilled fish or chicken can help restore balance. Stay well-hydrated by drinking plenty of water or unsweetened beverages to support your body's digestive processes after the rich and spicy Bicol Express.<br><br><a href='https://panlasangpinoy.com/how-to-cook-bicol-express-knr-pc'>Source</a></div>",
    "bistek_tagalog":"<div class='ingredients'><h3>Ingredients</h3><br>1 1/2 lbs beef sirloin thinly sliced<br>5 tablespoons soy sauce<br>4 pieces calamansi or 1-piece lemon<br>1/2 tsp ground black pepper<br>3 cloves garlic minced<br>3 pieces yellow onion sliced into rings<br>4 tablespoons cooking oil<br>1 cup water<br>1 pinch salt</div><br><div class='instructions'><h3>Instructions</h3><br>1. Marinate beef in soy sauce, lemon (or calamansi), and ground black pepper for at least 1 hour. Note: marinate overnight for best result<br>2. Heat the cooking oil in a pan then pan-fry half of the onions until the texture becomes soft. Set aside<br>3. Drain the marinade from the beef. Set it aside. Pan-fry the beef on the same pan where the onions were fried for 1 minute per side. Remove from the pan. Set aside<br>4. Add more oil if needed. Saute garlic and remaining raw onions until onion softens.<br>5. Pour the remaining marinade and water. Bring to a boil.<br>6. Add beef. Cover the pan and simmer until meat is tender. Note: Add water as needed.<br>7. Season with ground black pepper and salt as needed. Top with pan-fried onions.<br>8. Transfer to a serving plate. Serve hot.</div><br><div class='nutritionalfacts'><br><h3>Nutrition Facts - Bistek Tagalog</h3><br>1.Energy - 279kcal<br>2. Protein - 31g<br>3. Fat - 15g<br>4. Saturated Fat - 2g<br>7. Cholesterol - 74mg<br>8. Carbohydrates - 1g<br>9. Sodium - 1095mg<br>10. Potassium - 503mg<br>11. Vitamin C - 0.8mg <br>12. Calcium - 34mg<br>13. Iron - 2.8mg</div><br><div class='dietary'><br><h3>Dietary Recommendation</h3><br>After a meal of Bistek Tagalog, balance your intake with lighter, fiber-rich foods and healthy fats. Opt for a vegetable-based lunch such as a mixed greens salad with avocado and a light vinaigrette. For dinner, consider grilled fish or tofu with a side of steamed vegetables and brown rice. Drink plenty of water throughout the day and enjoy a piece of fruit, like an orange or a small banana, for a refreshing snack.<br><br><a href='https://panlasangpinoy.com/bistek-tagalog-beefsteak-recipe'>Source</a></div>",
    "buko_pie":"<div class='ingredients'><h3>Ingredients</h3><br>2 cups all-purpose flour<br>1/3 cup butter<br>1 teaspoon salt<br>1/3 cup vegetable shortening<br>6 to 8 tablespoons cold water<br>2 cups young coconut meat<br>3/4 cup granulated white sugar<br>1/2 cup cornstarch diluted in 1/2 cup young coconut water<br>1/2 cup evaporated milk</div><br><div class='instructions'><h3>Instructions</h3><br>1. Create the crust. Combine flour and salt then mix using a balloon whisk. Add butter and shortening then mix using a pastry mixer. Gradually add cold water a tablespoon at a time while mixing the ingredients. When everything is completely mixed,gather the mixture and divide into two equal parts. In a flat surface flatten each of the dough and roll using a rolling pin until wide enough to fit an eight or nine inch cake pan. Note: Sprinkle flour over the flat surface to prevent the dough fromsticking or use a silicon mat. Arrange the first dough over the cake pan. This will be the base. Set the second flattened dough aside. This will be needed after arranging the filling in the cake pan.<br>2. Make the filling by heating a saucepan and pour-in the milk. Let boil.<br>3. Add the granulated white sugar and stir.<br>4. Put-in the young coconut meat and cook for 3 minutes.<br>5. Pour-in the cornstarch diluted in young coconut water and stir thoroughly while cooking. Cook until the texture thickens.<br>6. Turn-off the heat and allow the mixture to cool down.<br>7. Preheat oven to 375 degrees Fahrenheit.<br>8. Arrange the cooked filling in the cake pan.<br>9. Put the second crust over the filling and seal the sides.<br>10. Create holes on the secondary crust using a fork. This will serve as exhaust vents that will prevent the crust from deforming.<br>11. Bake for 45 to 55 minutes or until the color turns golden brown. Note: Baking time may vary; make sure to check the color of the crust to determine if baking is complete.<br>12. Let cool and serve.</div><br><div class='nutritionalfacts'><br><h3>Nutrition Facts - Buko Pie</h3><br>1.Energy - 1270 kj | 304 kcal<br>2. Protein - 4.17g<br>3. Fat - 17.22g<br>4. Saturated Fat - 12.658g<br>5. Polyunsaturated Fat - 0.745g<br>6. Monounsaturated Fat - 2.763g<br>7. Cholesterol - 19mg<br>8. Carbohydrates - 34.38g<br>9. Sugar - 8.72g<br>10. Fibre - 3.8g<br>11. Sodium - 100mg<br>12. Potassium - 168mg   </div><br><div class='dietary'><br><h3>Dietary Recommendation</h3><br>After enjoying a slice of buko pie, it's advisable to balance your diet with lighter, nutrient-dense meals for the rest of the day. Focus on incorporating fresh vegetables, lean proteins, and whole grains. A good plan might include a vegetable salad with grilled chicken for lunch and a dinner of steamed fish with quinoa and a side of sautéed greens. Hydrate well and consider a fruit snack like an apple or a handful of berries to keep your overall intake balanced and nutritious.<br><br><a href='https://panlasangpinoy.com/coconut-buko-pie-recipe'>Source</a></div>",
    "bulalo":"<div class='ingredients'><h3>Ingredients</h3><br>2 lbs beef shank<br>½ cabbage whole leaf individually detached<br>1 bundle bok choy<br>2 cobs corn each cut into 3 parts<br>2 Tablespoons whole peppercorn<br>1/2 cup green onions cut unto 1 1/2 inch pieces<br>1 onion<br>34 ounces water<br>fish sauce to taste</div><br><div class='instructions'><h3>Instructions</h3><br>1. In a big cooking pot, pour in water and bring to a boil<br>2. Put-in the beef shank followed by the onion and whole pepper corn then simmer for 1.5 hours (30 mins if using a pressure cooker) or until meat is tender.<br>3. Add the corn and simmer for another 10 minutes<br>4. Add the fish sauce,cabbage, pechay, and green onion (onion leeks)<br>5. Serve hot.</div><br><div class='nutritionalfacts'><br><h3>Nutrition Facts - Bulalo</h3><br>1.Energy - 1615 kj | 386 kcal<br>2. Protein - 60.33g<br>3. Fat - 11.33g<br>4. Saturated Fat - 4.052g<br>5. Polyunsaturated Fat - 0.454g<br>6. Monounsaturated Fat - 5.061g<br>7. Cholesterol - 136mg<br>8. Carbohydrates - 34.38g<br>9. Carbohydrates - 8.18g<br>10. Sugar - 1.92g<br>11. Fibre - 1.5g<br>12. Sodium - 480mg<br>13. Potassium - 903mg</div><br><div class='dietary'><br><h3>Dietary Recommendation</h3><br>After enjoying a hearty serving of bulalo, it's important to balance your diet with lighter, nutrient-dense meals. Opt for a lunch of a quinoa salad with mixed vegetables and a light dressing. For dinner, consider a grilled chicken breast with a side of steamed broccoli and carrots. Stay hydrated and include a piece of fruit, such as an apple or a handful of berries, for a refreshing and nutritious snack.<br><br><a href='https://panlasangpinoy.com/bulalo-stewed-beef-shank'>Source</a></div>",
    "burger":"<div class='ingredients'><h3>Ingredients</h3><br>1 large egg<br>½ teaspoon salt<br>½ teaspoon ground black pepper<br>1 pound ground beef<br>½ cup fine dry bread crumbs</div><br><div class='instructions'><h3>Instructions</h3><br>1. Preheat an outdoor grill for high heat and lightly oil grate.<br>2. Whisk together egg, salt, and pepper in a medium bowl.<br>3. Add ground beef and bread crumbs and mix with your hands or a fork until well blended.<br>4. Form into four 3/4-inch-thick patties.<br>5. Place patties on the preheated grill. Cover and cook 6 to 8 minutes per side, or to desired doneness. An instant-read thermometer inserted into the center should read at least 160 degrees F (70 degrees C).<br>6. Serve hot and enjoy!</div><br><div class='nutritionalfacts'><br><h3>Nutrition Facts - Burger</h3><br>1. Calories - 317kcal<br>2. Carbohydrates - 10g, Sugar - 1g<br>3. Protein - 27g<br>4. Fat - 18g, Saturated Fat - 7g<br>5. Cholesterol - 125mg<br>6. Sodium - 475g<br>7. Calcium - 39g<br>8. Iron - 3g<br>9. Potassium - 347mg</div><br><div class='dietary'><br><h3>Dietary Recommendation</h3><br>After indulging in a burger, balance your diet with lighter, nutrient-rich Filipino-inspired meals. For your next meal, consider a vegetable stir-fry with kangkong (water spinach) and tofu, served with a small portion of brown rice. For dinner, opt for a grilled fish like bangus (milkfish) paired with a fresh ensaladang talong (eggplant salad). Stay hydrated with water or coconut water, and enjoy a piece of local fruit such as a mango or a few slices of papaya as a snack.<br><br><a href='https://www.allrecipes.com/recipe/25473/the-perfect-basic-burger'>Source</a></div>",
    "calamares":"<div class='ingredients'><h3>Ingredients</h3><br>1/2 lb medium to large sized squid cleaned and sliced into rings<br>3/4 cup all-purpose flour<br>1 piece raw egg beaten<br>3/4 cup breadcrumbs<br>1 teaspoon salt<br>1/2 teaspoon ground black pepper<br>2 cups cooking oil</div><br><div class='instructions'><h3>Instructions</h3><br>1. Combine squid, salt, and ground black pepper then mix well. Let stand for 10 minutes.<br>2. Heat a cooking pot the pour-in cooking oil.<br>3. Dredge the squid in flour then dip in beaten egg and roll over breadcrumbs.<br>4. When the oil is hot enough, deep-fry the squid until the color of the coating turns brown. Note: This should only take about 2 to 3 minutes in medium heat. Do not overcook the squid.<br>5. Remove the fried squid from the cooking pot and transfer in a plate lined with paper towels.<br>6. Serve with sinamak or Asian dipping sauce.</div><br><div class='nutritionalfacts'><br><h3>Nutrition Facts - Calamares</h3><br>1. Calories - 390kcal<br>2. Carbohydrates - 44g, Sugar - 2g<br>3. Protein - 38g<br>4. Fat - 4g, Saturated Fat - 1g<br>5. Cholesterol - 532mg<br>6. Sodium - 119g<br>7. Vitamin A - 140IU<br>8. Vitamin C - 10.6mg<br>9. Calcium - 122g<br>10. Iron - 2.6g</div><br><div class='dietary'><br><h3>Dietary Recommendation</h3><br>After enjoying calamares, balance your diet with lighter, nutrient-dense Filipino-inspired meals. For your next meal, have a sinigang na hipon (shrimp in sour soup) with a generous portion of vegetables and a small serving of brown rice. For dinner, opt for a grilled chicken breast paired with a fresh ensaladang pipino (cucumber salad) and a side of steamed ampalaya (bitter melon). Hydrate well with water or buko juice, and enjoy a piece of local fruit like a banana or some lanzones for a refreshing snack.<br><br><a href='https://www.kawalingpinoy.com/fried-calamari/'>Nutrition facts source</a><br><a href='https://panlasangpinoy.com/calamares-calamari-recipe'>Recipe and ingredients source</a></div>",
    "cassava_cake":"<div class='ingredients'><h3>Ingredients</h3><br>2 packs grated cassava about 2 lbs total weight<br>2 cups coconut milk<br>1/2 12 oz. can evaporated milk<br>3 pieces egg<br>1/4 cup butter melted<br>6 tablespoons cheddar cheese grated<br>1/2 cup condensed milk<br>14 tablespoons granulated white sugar<br>2 tablespoons flour<br>2 tablespoons sugar<br>1/2 cup condensed milk<br>2 tablespoons cheddar cheese grated<br>2 cups coconut milk</div><br><div class='instructions'><h3>Instructions</h3><br>1. Make the batter by combining the grated cassava, butter, 1/2 cup condensed milk, 1/2 cup evaporated milk, 6 tablespoons cheddar cheese, 14 tablespoons sugar, and 2 eggs in a mixing bowl and mix thoroughly.<br>2. Add the 2 cups coconut milk in the mixing bowl where the mixed ingredients are. Mix again.<br>3. Grease the baking tray then pour-in the batter (these are the ingredients that you just mixed together).<br>4. Pre -heat oven for 350 degrees Fahrenheit for 10 minutes then put-in the baking tray with batter and bake for 1 hour.Remove from the oven and set aside.<br>5. Meanwhile prepare the topping by combining 2 tablespoons sugar and flour in the heated saucepan.<br>6. Pour-in 1/2 cup condensed milk then mix thoroughly.<br>7. Add 2 tablespoons cheddar cheese while stirring constantly.<br>8. Pour 2 cups of coconut milk and stir constantly for 10 minutes<br>9. Pour the topping over the Cassava Cake (baked batter) and spread evenly.<br>10. Separate the yolk from the egg white of the remaining egg (we'll be needing the egg white only)<br>11. Glaze the topping with the egg white using a basting brush. Simply dip the brush to the egg white and brush it on the cassava cake.<br>12. Set your oven to broil mode. Broil the Cassava cake until color turns light brown.<br>13. Garnish with extra grated cheese on top. Serve.</div><br><div class='nutritionalfacts'><br><h3>Nutrition Facts - Cassava Cake</h3><br>1. Calories - 281<br>2. Total Fat - 7.9g, Saturated Fat - 3.8g, Polyunsaturated Fat - 0.5g, Monounsaturated - Fat 3.1g<br>3. Sodium - 368mg<br>4. Total Carbohydrates - 51g, Dietary Fiber - 2.4g, Sugars - 2.3g<br>5. Protein - 2.2g<br>6. Calcium - 25mg<br>7. Iron - 0.9mg<br>8. Potassium - 398.2mg<div class='dietary'><br><h3>Dietary Recommendation</h3><br>After enjoying a slice of cassava cake, balance your diet with lighter, nutrient-rich meals. For lunch, consider a bowl of tinola with plenty of green papaya and malunggay leaves, accompanied by a small serving of brown rice. For dinner, opt for grilled tilapia with a side of steamed okra and kamote tops (sweet potato leaves) salad. Stay hydrated with water or calamansi juice, and for a snack, enjoy a piece of local fruit like pineapple or a few slices of watermelon.<br><br><a href='https://www.nutritionix.com/food/cassava-cake'>Nutrition facts source</a><br><a href='https://panlasangpinoy.com/filipino-food-dessert-holiday-cassava-cake-recipe'>Recipe and ingredients source</a></div>",
    "champorado":"<div class='ingredients'><h3>Ingredients</h3><br>8 tbsp cocoa powder or about 4 pieces tableya<br>1 cup glutinous rice malagkit<br>1/2 cup sugar<br>3 1/2 cups water<br>condensed milk</div><br><div class='instructions'><h3>Instructions</h3><br>1. Pour 2 1/2 cups of water in a pot and bring to a boil<br>2. Put-in the glutinous rice and allow water to re-boil for a few minutes<br>3. Dilute the cocoa powder in 1 cup warm water then pour-in the pot. Stir continuously<br>4. Once the glutinous rice is cooked (about 12 to 18 minutes of cooking with constant stirring), add the sugar and cook for another 5 minutes or until the texture becomes thick.<br>5. Remove from the pot and place in a serving bowl.<br>6. Serve hot with a swirl of condensed milk on top.</div><br><div class='nutritionalfacts'><br><h3>Nutrition Facts - Champorado</h3><br>1. Calories - 330<br>2. Total Fat - 3.00g<br>3. Sodium - 150mg<br>4. Total Carbohydrate - 70.00g, Dietary Fiber - 3g, Sugars - 38g<br>5. Protein - 8.0g</div><br><div class='dietary'><br><h3>Dietary Recommendation</h3><br>After enjoying a bowl of champorado, balance your diet with lighter, nutrient-rich meals. For lunch, consider a vegetable stir-fry with sitaw (string beans) and tofu, served with a small portion of brown rice. For dinner, opt for grilled chicken inasal with a side of steamed kangkong (water spinach) and a simple tomato and cucumber salad. Stay hydrated with water or buko juice, and for a snack, enjoy a piece of local fruit like a banana or a few slices of papaya.<br><br><a href='https://mobile.fatsecret.com/calories-nutrition/nora-kitchen/chocolate-porridge-champorado'>Nutrition facts source</a><br><a href='https://panlasangpinoy.com/filipino-food-tsampurado-champorado-champurado-chocolate-rice-porridge-recipe'>Recipe and ingredients source</a></div>",
    "chicharon":"<div class='ingredients'><h3>Ingredients</h3><br>2 lbs. pork belly<br>6 cups water<br>2 cups cooking oil<br>1 1/2 tablespoons whole peppercorn<br>8 pieces dried bay leaves</div><br><div class='instructions'><h3>Instructions</h3><br>1. Boil water in a cooking pot. Add salt, bay leaves, whole peppercorn, and pork. Cover and continue to boil for 60 minutes.<br>2. Remove from the pot and let pork cool down. Poke holes on the skin using a toothpick. Slice the pork in half for a thinner piece.<br>3. Rub salt all over the pork belly. Air dry for 1 hour. Note: placing the pork in front of an electric fan is a good idea.<br>4. Heat oil on a cooking pot. Deep fry pork belly until crispy and golden brown. Note: be extra careful when doing this step. Use of splatter screen is recommended.<br>5. Remove crispy pork belly from the cooking pot and place over a wire rack. Let it cool down.<br>6. Transfer to a serving plate. Serve with spicy vinegar.</div><br><div class='nutritionalfacts'><br><h3>Nutrition Facts - Chicharon</h3><br>1. Calories - 80<br>2. Total Fat - 5.00g, Saturated Fat - 1.500g<br>3. Cholesterol - 15mg<br>4. Sodium - 120mg<br>5. Protein - 9.0g</div><br><div class='dietary'><br><h3>Dietary Recommendation</h3><br>After indulging in chicharon, balance your diet with lighter, nutrient-rich Filipino dishes. For lunch, enjoy a bowl of sinigang na baboy (pork sour soup) with plenty of vegetables and a small portion of brown rice. For dinner, opt for grilled bangus (milkfish) served with ensaladang talong (eggplant salad) and a side of steamed okra. Keep hydrated with water or fresh buko juice, and for a snack, munch on some toasted pili nuts or enjoy a piece of local fruit like mango or pineapple.<br><br><a href='https://mobile.fatsecret.com/calories-nutrition/da-heo/chicharon'>Nutrition facts source</a><br><a href='https://panlasangpinoy.com/crispy-pork-belly-chicharon'>Recipe and ingredients source</a></div>",
    "chicken_adobo":"<div class='ingredients'><h3>Ingredients</h3><br>2 lbs chicken sliced into serving pieces<br>1 piece Knorr Chicken Cube<br>1 head garlic crushed<br>6 tablespoons white vinegar<br>6 tablespoons soy sauce<br>1 1/2 teaspoons whole peppercorn<br>5 pieces dried bay leaves<br>1/2 cup water<br>1 teaspoon sugar<br>4 tablespoons cooking oil</div><br><div class='instructions'><h3>Instructions</h3><br>1. Combine chicken, 1/4 of the total amount of garlic, whole peppercorn, dried bay leaves, soy sauce, vinegar, and water in a cooking pot. Cover and let boil. Stir and make sure that all ingredients are well blended.<br>2. Add Knorr Chicken Cube and sugar. Stir. Cover the pot and cook for 10 minutes.<br>3. Turn the chicken over and cook the opposite side for another 10 minutes. Set aside.<br>4. Heat oil in a clean pan. Saute remaining garlic until it turns light brown.<br>5. Pan fry the chicken for 1 minute per side. Pour the adobo sauce into the pan. Boil until it reduces to half.<br>6. Transfer to a serving plate. Serve with warm rice.</div><br><div class='nutritionalfacts'><br><h3>Nutrition Facts - Chicken Adobo</h3><br>1. Calories - 107<br>2. Total Fat - 4.93g, Saturated Fat - 3.8g, Polyunsaturated Fat - 1.14g, Monounsaturated - Fat 1.904g<br>3. Cholesterol - 41mg<br>4. Sodium - 392mg<br>5. Total Carbohydrates - 2.48g, Dietary Fiber - 0.3g, Sugars - 0.86g<br>6. Protein - 11.88g<br>7. Calcium - 14mg<br>8. Iron - 1.05mg<br>9. Potassium - 147mg<br>10. Vitamin A - 9mcg<br>11. Vitamin C - 0.5mg</div><br><div class='dietary'><br><h3>Dietary Recommendation</h3><br>After relishing chicken adobo, balance your diet with lighter, nutrient-rich Filipino fare. For lunch, savor a bowl of monggo guisado (mung bean stew) with ampalaya (bitter melon) and a small serving of brown rice. For dinner, delight in grilled tilapia paired with ensaladang talong (grilled eggplant salad) and a side of steamed kangkong (water spinach). Stay hydrated with water or fresh buko juice, and for a snack, enjoy some roasted peanuts or a piece of local fruit like banana or mango.<br><br><a href='https://mobile.fatsecret.com/calories-nutrition/generic/chicken-adobo'>Nutrition facts source</a><br><a href='https://panlasangpinoy.com/easy-chicken-adobo-recipe'>Recipe and ingredients source</a></div>",
    "chicken_bistek":"<div class='ingredients'><h3>Ingredients</h3><br>3/4 kilo Chicken drumsticks<br>1/4 cup soy sauce<br>1 medium Red onion, peeled and sliced<br>1 large White onion, peeled and sliced<br>4 cloves garlic, peeled and minced<br>1/2 teaspoon black pepper<br>1/4 cup calamansi juice<br>3 tablespoons canola oil<br>1 cup water<br>2 tablespoons liver spread</div><br><div class='instructions'><h3>Instructions</h3><br>1. Wash and clean the chicken and drain.<br>2. In a large bowl, combine onions, garlic, peppercorns, Calamansi juice and soy sauce, then add the chicken and mix well.<br>3. Massage marinade into Chicken meat then marinate inside the refrigerator for about 2 hours.<br>4. Drain the chicken then set aside and reserve the marinade.<br>5. In a deep fry pan pour Canola oil then apply heat.<br>6. Fry chicken and Cook until chicken is lightly browned then add reserved onions and garlic from the marinade.<br>7. Add reserved marinade and water and bring to a boil.<br>8. Lower heat, cover, and simmer for 40 minutes or until chicken is cooked through.<br>9. Add Liver spread and cook for about 3 minutes until sauce is thickened.<br>10. Season with salt to taste.<br>11. Garnish with sliced onion rings and serve hot with rice.</div><br><div class='nutritionalfacts'><br><h3>Nutrition Facts - Chicken Bistek</h3><br>1. Calories - 478<br>2. Total Fat - 36g, Saturated Fat - 9g<br>3. Cholesterol - 197mg<br>4. Sodium - 734mg<br>5. Total Carbohydrates - 4g, Fiber - 1g, Sugar - 1g<br>6. Protein - 33g<br>7. Calcium - 25mg<br>8. Iron - 2mg<br>9. Potassium - 469mg<br>10. Vitamin A - 1514 IU<br>11. Vitamin C - 6mg</div><br><div class='dietary'><br><h3>Dietary Recommendation</h3><br>After enjoying chicken bistek, balance your diet with lighter, nutrient-rich Filipino dishes. For lunch, relish a bowl of pinakbet (mixed vegetable stew) with a serving of grilled fish and a small portion of brown rice. For dinner, opt for inihaw na liempo (grilled pork belly) served with ensaladang talong (eggplant salad) and a side of steamed kangkong (water spinach). Keep hydrated with water or fresh calamansi juice, and for a snack, munch on some toasted garlic peanuts or savor a piece of local fruit like guava or pineapple.<br><br><a href='https://mobile.fatsecret.com/calories-nutrition/generic/chicken-adobo'>Nutrition facts source</a><br><a href='https://www.pinoyrecipe.net/chicken-bistek-recipe'>Recipe and ingredients source</a></div>",
    "chicken_inasal":"<div class='ingredients'><h3>Ingredients</h3><br>2 lbs chicken cut into serving pieces<br>2 tablespoons ginger minced<br>2 tablespoons garlic minced<br>3/4 cup lemongrass chopped<br>1 cup coconut vinegar<br>1/2 cup lemon or calamansi juice<br>1 tablespoon salt<br>1/4 cup brown sugar<br>1 cup lemon soda softdrink<br>1/2 tablespoon ground black pepper<br>Basting Sauce:<br>3 tablespoons annatto oil atsuete oil<br>1/2 cup margarine softened<br>1/4 teaspoon salt<br>1 teaspoon lemon or calamansi juice</div><br><div class='instructions'><h3>Instructions</h3><br>1. In a freezer bag or large bowl, combine chicken, lemongrass, salt, ground black pepper, ginger, garlic, brown sugar, vinegar, lemon-lime soda, and lemon juice.<br>2. Stir or shake the mixture until every ingredient is well incorporated. Marinade for 1 to 3 hours.<br>3. In a bowl, combine margarine, annatto oil, salt, and lemon juice then stir. Set aside.<br>4. Grill the chicken while basting generous amount of the margarine mixture.<br>5. Transfer the grilled chicken to a serving plate.<br>6. Serve with sinamak.</div><br><div class='nutritionalfacts'><br><h3>Nutrition Facts - Chicken Inasal</h3><br>1. Calories - 734<br>2. Total Fat - 53g, Saturated - 15.5g<br>3. Cholesterol - 243mg<br>4. Sodium - 809mg<br>5. Total Carbohydrates - 3.5<br>6. Protein - 57.7g</div><br><div class='dietary'><br><h3>Dietary Recommendation</h3><br>After enjoying chicken inasal, balance your diet with lighter, nutrient-rich Filipino dishes. For lunch, savor a bowl of sinigang na bangus (milkfish sour soup) with plenty of vegetables and a small portion of brown rice. For dinner, opt for grilled tilapia served with ensaladang talong (grilled eggplant salad) and a side of steamed okra. Stay hydrated with water or fresh calamansi juice, and for a snack, enjoy some roasted peanuts or a piece of local fruit like mango or banana.<br><br><a href='https://www.myfitnesspal.com/food/nutrition-calories/chicken-inasal-bone-in-grams-194344731455461'>Nutrition facts source</a><br><a href='https://panlasangpinoy.com/grilled-chicken-inasal-recipe'>Recipe and ingredients source</a></div>",
    "crispy_pata":"<div class='ingredients'><h3>Ingredients</h3><br>1 4lb. Pig leg<br>4 tablespoons Knorr Liquid Seasoning<br>1/2 cup Shaoxing cooking wine optional<br>8 pieces dried bay leaves<br>1 tablespoon whole peppercorn<br>6 cloves garlic crushed<br>2 quarts water<br>1 quart cooking oil</div><br><div class='instructions'><h3>Instructions</h3><br>1. Boil water in a wide cooking pot.<br>Add bay leaves, garlic, and whole peppercorn<br>Put the pig leg into the pot. Cover and continue to boil in low to medium heat for 1 hour. Note: you may turn the leg over after 30 minutes in order to equally tenderize the other side.<br>2. Remove the pig leg from the cooking pot and then put in a clean plate. Let it cool down until you can easily grab it with your hands. Pour cooking wine all over the leg. Rub and make sure that the entire leg is covered. Pour Knorr liquid seasoningall over the pata. Rub again to ensure that the entire leg gets coated.<br>3. Put the leg on a cooling rack or arrange it in a way that both sides are exposed. Let it air dry for at least 3 hours. Note: you may place a small electric fan in front of the leg to let it dry quickly.<br>4. Heat oil in a deep cooking pot. When the temperature reaches 320F, slowly put the air-dried pork into the pot. Cover the pot while leaving a portion open for the steam to escape. Deep fry one side for 12 minutes or until crispy. Turn the leg overand deep fry the opposite side using the amount of time. Note: you can remove the cover of the pot and replace it with a splatter screen once the sound of the oil starts to mellow down, but be on guard all the time.<br>5. Remove the Crispy Pata from the cooking pot. Place it in a plate with a cooling rack or paper towel to let the oil drip.<br>6. Transfer to a serving plate. Serve with papaya atchara and bowl of spicy vinegar dip.</div><br><div class='nutritionalfacts'><br><h3>Nutrition Facts - Crispy Pata</h3><br>1. Calories - 560kcal<br>2. Carbohydrates - 16g, Fiber - 1g, Sugar - 10g<br>3. Protein - 55g<br>4. Fat - 27g, Saturated Fat - 7g<br>5. Cholesterol - 185mg<br>6. Sodium - 229mg<br>7. Potassium - 1055mg<br>8. Vitamin A - 30 IU<br>9. Vitamin C - 6mg<br>10. Calcium - 79mg<br>11. Iron - 4mg</div><br><div class='dietary'><br><h3>Dietary Recommendation</h3><br>After indulging in crispy pata, balance your diet with lighter, nutrient-rich Filipino fare. For lunch, enjoy a bowl of ginisang munggo (sauteed mung beans) with malunggay leaves and a small serving of brown rice. For dinner, delight in grilled bangus (milkfish) paired with ensaladang talong (grilled eggplant salad) and a side of steamed kangkong (water spinach). Stay hydrated with water or fresh buko juice, and for a snack, enjoy some roasted peanuts or a piece of local fruit like banana or mango.<br><br><a href='https://www.kawalingpinoy.com/crispy-pata'>Nutrition facts source</a><br><a href='https://panlasangpinoy.com/crispy-pata'>Recipe and ingredients source</a></div>",
    "cupcakes":"<div class='ingredients'><h3>Ingredients</h3><br>250g unsalted butter, softened<br>250g caster sugar<br>250g self-raising flour<br>4 medium eggs<br>4 tablespoons milk<br>Pinch of salt (optional)<br>Ice-cream scoop (optional)<br>2 x 12-hole muffin tins, lined with paper cases</div><br><div class='instructions'><h3>Instructions</h3><br>1. Heat the oven to 190C (170C, Gas 5). Line two muffin trays with 12 cupcake cases in each or bake in batches of 12 using one muffin tray.<br>2. Start by creaming butter and sugar together in a bowl using a wooden spoon or electric whisk. Beat until soft, fluffy and pale in colour. Then add the flour, eggs, milk, and salt and whisk until the mixture is smooth.<br>3. Divide the mixture between all the paper cases making sure to get an even amount of mixture in each. You can use an ice-cream scoop for this.<br>4. Put the lined tins in the oven and bake for 15 minutes, then swap the position of the tins over so the bottom tray is now at the top of the oven, and visa versa, and bake for a further 3-7 minutes, until both trays of cupcakes are a light goldencolour.<br>5. To make sure they are fully cooked, poke a clean skewer into the cupcakes - if it comes out clean the sponge is cooked. Remove the tins from the oven.<br>6. Leave the cupcakes to cool in the tins for a few minutes and then transfer them onto a wire rack to cool. Once completely cooled you can decorate with buttercream, icing mixture, and much more.</div><br><div class='nutritionalfacts'><br><h3>Nutrition Facts - Cupcake</h3><br>1. Calories - 110<br>2. Total Fat - 3.71g, Saturated Fat - 1.068g, Polyunsaturated Fat - 0.535g, Monounsaturated fat - 1.86g<br>3. Cholesterol - 16mg<br>4. Sodium - 162mg<br>5. Total Carbohydrates - 17.62g, Dietary Fiber - 0.2g, Sugar - 8.66g<br>6. Protein - 1.66g<br>7. Potassium - 30mg<br>8. Vitamin A - 9mcg<br>10. Calcium - 49mg<br>11. Iron - 0.97mg</div><br><div class='dietary'><br><h3>Dietary Recommendation</h3><br>After indulging in crispy pata, balance your diet with lighter, nutrient-rich Filipino fare. For lunch, enjoy a bowl of ginisang munggo (sauteed mung beans) with malunggay leaves and a small serving of brown rice. For dinner, delight in grilled bangus (milkfish) paired with ensaladang talong (grilled eggplant salad) and a side of steamed kangkong (water spinach). Stay hydrated with water or fresh buko juice, and for a snack, enjoy some roasted peanuts or a piece of local fruit like banana or mango.<br><br><a href='https://mobile.fatsecret.com/calories-nutrition/generic/cake-cupcake-without-icing'>Nutrition facts source</a><br><a href='https://www.goodto.com/recipes/basic-cupcake-recipe'>Recipe and ingredients source</a></div>",
    "donuts":"<div class='ingredients'><h3>Ingredients</h3><br>⅜ cup milk<br>2 tablespoons white vinegar<br>½ cup white sugar<br>2 tablespoons shortening<br>1 egg<br>½ teaspoon vanilla extract<br>2 cups sifted all-purpose flour<br>½ teaspoon baking soda<br>¼ teaspoon salt<br>1 quart oil for deep frying<br>½ cup confectioners' sugar for dusting</div><br><div class='instructions'><h3>Instructions</h3><br>1. Stir together milk and vinegar; let stand for a few minutes until thick.<br>2. Cream together sugar and shortening in a mixing bowl until smooth. Beat in egg and vanilla until well-blended. Sift together flour, baking soda, and salt in a separate bowl; stir into sugar mixture alternating with milk mixture.<br>3. Roll dough out on a floured surface to 1/3-inch thickness. Cut into donuts using a donut cutter. Let stand for about 10 minutes.<br>4. Heat oil in a large, deep skillet to 375 degrees F (190 degrees C).<br>5. Fry donuts in hot oil in batches until golden, turning over once, about 1 to 2 minutes per side. Drain on paper towels.<br>6. Dust with confectioners' sugar while they are still warm and serve.</div><br><div class='nutritionalfacts'><br><h3>Nutrition Facts - Doughnuts</h3><br>1. Calories - 190<br>2. Total Fat - 10.51g, Saturated Fat - 2.171g, Polyunsaturated Fat - 2.48g, Monounsaturated fat - 5.097g<br>3. Cholesterol - 10mg<br>4. Sodium - 204mg<br>5. Total Carbohydrates - 21.62g, Dietary Fiber - 0.6g, Sugar - 10.63g<br>6. Protein - 2.62g<br>7. Potassium - 54mg<br>8. Vitamin A - 10mcg<br>10. Calcium - 20mg<br>11. Iron - 0.92mg</div><br><div class='dietary'><br><h3>Dietary Recommendation</h3><br>After indulging in donuts, balance your diet with nutrient-rich meals. For breakfast, enjoy a bowl of Greek yogurt topped with sliced strawberries and a drizzle of honey. For lunch, opt for a colorful salad with mixed greens, grilled shrimp, avocado, and a lemon vinaigrette. For dinner, savor baked chicken breast with roasted sweet potatoes and steamed green beans. Keep hydrated with water or herbal tea, and for a snack, enjoy sliced apple with almond butter or a small portion of trail mix.<br><br><a href='https://mobile.fatsecret.com/calories-nutrition/generic/doughnut'>Nutrition facts source</a><br><a href='https://www.allrecipes.com/recipe/72964/super-easy-doughnuts'>Recipe and ingredients source</a></div>",
    "filipino_spaghetti":"<div class='ingredients'><h3>Ingredients</h3><br>2 lbs. Spaghetti noodles<br>1 lb. ground pork<br>6 ounces luncheon meat minced<br>4 pieces hotdogs or beef franks<br>35 ounces Filipino Style Spaghetti Sauce<br>1/2 cup shredded cheddar cheese<br>1 1/2 cups beef broth<br>1 medium onion minced<br>1 teaspoon minced garlic<br>Salt and pepper to taste<br>3 tablespoons cooking oil</div><br><div class='instructions'><h3>Instructions</h3><br>1. Cook the Spaghetti noodles according to package instructions. Once cooked, transfer to a bowl. Set aside.<br>2. Heat the oil in a Pan.<br>3. Saute the onion and garlic.<br>4. Once the onions becomes soft, add the ground pork. Cook until the color turns light brown.<br>5. Add the luncheon meat and hotdog. Stir and cook for 2 to 3 minutes.<br>6. Pour-in the Spaghetti sauce and beef broth. Stir and let boil. Cover and simmer for 30 minutes.<br>7. Try to taste the sauce and add salt and pepper if needed.<br>8. Pour the Filipino Style Spaghetti sauce over the Spaghetti. Top with shredded cheese.</div><br><div class='nutritionalfacts'><br><h3>Nutrition Facts - Filipino Spaghetti</h3><br>1. Calories - 529kcal<br>2. Carbohydrates - 63g, Fiber - 4g, Sugar - 14g<br>3. Protein - 23g<br>4. Fat - 19g, Saturated Fat - 7g<br>5. Cholesterol - 56mg<br>6. Sodium - 1068mg<br>7. Potassium - 853mg<br>8. Vitamin A - 1190 IU<br>9. Vitamin C - 29.5mg<br>10. Calcium - 106mg<br>11. Iron - 3.8mg</div><br><div class='dietary'><br><h3>Dietary Recommendation</h3><br>After enjoying Filipino spaghetti, balance your diet with lighter options. For breakfast, opt for oatmeal topped with sliced bananas and a sprinkle of chia seeds. For lunch, enjoy a vegetable stir-fry with tofu and a side of brown rice. For dinner, savor grilled fish with a mixed salad of lettuce, tomatoes, and cucumber. Stay hydrated with water or coconut water, and for a snack, munch on air-popped popcorn or enjoy a piece of fresh fruit like mango or pineapple.<br><br><a href='https://www.kawalingpinoy.com/filipino-style-spaghetti/'>Nutrition facts source</a><br><a href='https://panlasangpinoy.com/filipino-style-spaghetti'>Recipe and ingredients source</a></div>",
    "french_fries":"<div class='ingredients'><h3>Ingredients</h3><br>7 pieces baking potatoes<br>A dash of salt<br>4 cups cooking oil</div><br><div class='instructions'><h3>Instructions</h3><br>1. Peel the potatoes. Use a vegetable peeler to save time.<br>2. Slice the potatoes into long thin pieces.<br>3. Soak the potatoes in ice water for 30 minutes.<br>4. Drain the water and dry the potatoes using a paper towel.<br>5. Deep fry the potatoes for 10 minutes or until the color turns light brown. Do not put too many potatoes in a batch as it will take more time for it to be cooked.<br>6. Remove the potatoes from the deep fryer or cooking pot and allow to cool for 5 minutes.<br>7. Put the fried potatoes back in the fryer and fry for another 3 minutes.<br>8. Remove the fried potatoes and transfer to a plate with paper towels. Sprinkle some salt to taste.</div><br><div class='nutritionalfacts'><br><h3>Nutrition Facts - French Fries</h3><br>1. Calories - 156<br>2. Total Fat - 8.01g, Saturated Fat - 1.869g, Polyunsaturated Fat - 1.304g, Monounsaturated fat - 4.664g<br>3. Sodium - 171mg<br>4. Total Carbohydrates - 20.33g, Dietary Fiber - 1.9g, Sugar - 0.33g<br>5. Protein - 1.98g<br>6. Potassium - 300mg<br>7. Vitamin C - 3.1mcg<br>8. Calcium - 7mg<br>9. Iron - 0.69mg</div><br><div class='dietary'><br><h3>Dietary Recommendation</h3><br>After indulging in French fries, balance your diet with lighter options. For breakfast, enjoy scrambled eggs with whole grain toast and sliced tomatoes. For lunch, opt for a quinoa salad with mixed greens, grilled chicken, and a light vinaigrette. For dinner, savor grilled salmon with roasted vegetables and a side of couscous. Stay hydrated with water or herbal tea, and for a snack, enjoy carrot sticks with hummus or a small handful of almonds.<br><br><a href='https://panlasangpinoy.com/how-to-make-homemade-crispy-french-fries-recipe'>Source</a></div>",
    "fried_rice":"<div class='ingredients'><h3>Ingredients</h3><br>4 cups leftover steamed white rice<br>4 ounces ham minced<br>2 eggs beaten<br>1/4 teaspoon salt<br>1/2 teaspoon garlic powder<br>3 tablespoons cooking oil<br>1 cup frozen green peas<br>1/2 cup chopped green onions</div><br><div class='instructions'><h3>Instructions</h3><br>1. Gently mash the leftover rice using your hands to loosen it. Make sure that your hand are clean.<br>2. Add salt and garlic powder and toss. Set aside.<br>3. Meanwhile, heat the cooking oil in a frying pan.<br>4. Once the oil becomes hot, sauté the minced ham. Continue to cook the ham for 1 minute.<br>5. Put the ham on one side of the pan. Pour-in the beaten eggs. Cook one side for 1 minute. Flip the egg and cook the other side for another minute. Separate the eggs into multiple pieces by letting the tip of the spatula run through in a choppingmotion.<br>6. Add the rice. Cook and continuously toss every minute for 5 minutes.<br>7. Put-in the green peas. Toss and cook for 3 to 5 minutes.<br>8. Transfer to a serving plate. Top with chopped green onions.</div><br><div class='nutritionalfacts'><br><h3>Nutrition Facts - Fried Rice</h3><br>1. Calories - 333<br>2. Total Fat - 12.34g, Saturated Fat - 2.251g, Polyunsaturated Fat - 5.344g, Monounsaturated fat - 3.776g<br>3. Cholesterol - 103mg<br>4. Sodium - 822mg<br>5. Total Carbohydrates - 41.7g, Dietary Fiber - 1.4g, Sugar - 1.5g<br>6. Protein - 12.47g<br>7. Potassium - 202mg<br>8. Vitamin A - 42mcg<br>9. Vitamin C - 3.4mcg<br>10. Calcium - 38mg<br>11. Iron - 2.75mg</div><br><div class='dietary'><br><h3>Dietary Recommendation</h3><br>After enjoying fried rice, balance your diet with lighter options. For breakfast, opt for oatmeal topped with sliced bananas and a sprinkle of cinnamon. For lunch, enjoy a colorful salad with mixed greens, grilled shrimp, avocado, and a lemon vinaigrette. For dinner, savor baked chicken breast with roasted sweet potatoes and steamed green beans. Keep hydrated with water or herbal tea, and for a snack, enjoy sliced apple with almond butter or a small portion of trail mix.<br><br><a href='https://mobile.fatsecret.com/calories-nutrition/generic/rice-fried'>Nutrition facts source</a><br><a href='https://panlasangpinoy.com/fried-rice'>Recipe and ingredients source</a></div>",
    "ginataang_gulay":"<div class='ingredients'><h3>Ingredients</h3><br>1/2 lb. kalabasa cubed<br>15 pieces sitaw cut into 2 inch pieces<br>6 ounces pork belly sliced into small pieces<br>1 pack Knorr Ginataang Gulay mix 45 g<br>12 pieces shrimp<br>1 piece onion chopped<br>3 pieces garlic minced<br>2 cups water<br>2 tablespoons cooking oil</div><br><div class='instructions'><h3>Instructions</h3><br>1. Boil water in a sauce pan. Add pork. Cover and cook between low to medium heat for 20 minutes.<br>2. Remove the pork from the sauce pan. Set aside. Reserve the water.<br>3. Heat oil in a pan. Saute onion and garlic until it onion softens.<br>4. Add boiled pork. Saute for 1 minute.<br>5. Combine Knorr Ginataang Gulay Recipe Mix with the water used to boil pork. Stir and then pour the mixture into the pot. Let boil.<br>6. Add kalabasa. Cover and cook for 3 minutes.<br>7. Add shrimp and sitaw. Cover and continue to cook for 5 to 7 minutes.<br>8. Transfer to a serving plate. Serve.</div><br><div class='nutritionalfacts'><br><h3>Nutrition Facts - Ginataang Gulay</h3><br>1. Calories - 671kcal<br>2. Carbohydrates - 44g, Fiber - 12g, Sugar - 14g<br>3. Protein - 19g<br>4. Fat - 51g, Saturated Fat - 32g, Polyunsaturated Fat - 4g, Monounsaturated Fat - 12g<br>5. Cholesterol - 103mg<br>6. Sodium - 354mg<br>7. Potassium - 1494mg<br>8. Vitamin A - 2513 IU<br>9. Vitamin C - 40mg<br>10. Calcium - 187mg<br>11. Iron - 8mg</div><br><div class='dietary'><br><h3>Dietary Recommendation</h3><br>After enjoying ginataang gulay, balance your diet with lighter options. For breakfast, opt for a fruit smoothie with spinach, banana, and almond milk. For lunch, enjoy a mixed vegetable stir-fry with tofu and a side of brown rice. For dinner, savor grilled fish with a side of steamed vegetables and quinoa. Stay hydrated with water or coconut water, and for a snack, munch on air-popped popcorn or enjoy a piece of fresh fruit like mango or pineapple.<br><br><a href='https://www.kawalingpinoy.com/ginataang-gulay'>Nutrition facts source</a><br><a href='https://panlasangpinoy.com/ginataang-gulay-recipe-knr-mm'>Recipe and ingredients source</a></div>",
    "halo-halo":"<div class='ingredients'><h3>Ingredients</h3><br>1-2 tbsp syrup-packed red mung beans, white beans, and/or garbanzo beans1 tbsp sweetened jackfruit<br>1 tbsp macapuno strings (coconut sport)<br>1 tbsp nata de coconut (coconut gel)<br>1 cup shaved ice<br>1 tbsp ube halaya jam<br>2 tbsp Leche Flan, purchased<br>2 to 4 tbsp evaporated milk<br>2 tbsp ube ice cream</div><br><div class='instructions'><h3>Instructions</h3><br>1. In a tall glass or a trifle dish, layer the assorted beans, sweetened jackfruit, coconut gel, and coconut strings. Feel free to add more or less of any of the ingredients you enjoy.<br>2. Add shaved ice to fill the glass, leaving room for toppings. Top with ube halaya, leche flan, and ube ice cream.<br>3. To finish the halo-halo recipe, drizzle evaporated milk over the top. Mix and enjoy. Halo-halo is best enjoyed right away.</div><br><div class='nutritionalfacts'><br><h3>Nutrition Facts - Halo-halo</h3><br>1. Calories - 532kcal<br>2. Carbohydrates - 72g, Fiber - 5g, Sugar - 30g<br>3. Protein - 12g<br>4. Fat - 22g, Saturated Fat - 15g, Polyunsaturated Fat - 1g, Monounsaturated Fat - 5g<br>5. Cholesterol - 84mg<br>6. Sodium - 281mg<br>7. Potassium - 761mg<br>8. Vitamin A - 597 IU<br>9. Vitamin C - 6mg<br>10. Calcium - 373mg<br>11. Iron - 1mg</div><br><div class='dietary'><br><h3>Dietary Recommendation</h3><br>After indulging in halo-halo, balance your diet with lighter options. For breakfast, enjoy Greek yogurt with mixed berries and a drizzle of honey. For lunch, opt for a vegetable salad with grilled chicken and a light vinaigrette dressing. For dinner, savor grilled fish with a side of steamed vegetables and a small portion of brown rice. Keep hydrated with water or herbal tea, and for a snack, enjoy sliced cucumber with hummus or a small handful of nuts.<br><br><a href='https://www.kawalingpinoy.com/halo-halo'>Nutrition facts source</a><br><a href='https://www.bhg.com/halo-halo-recipe-7112645'>Recipe and ingredients source</a></div>",
    "hotdog_sandwich":"<div class='ingredients'><h3>Ingredients</h3><br>8 hot dogs, chopped<br>⅔ cup shredded Cheddar cheese<br>3 tablespoons pickle relish<br>3 tablespoons ketchup<br>2 teaspoons prepared mustard<br>3 tablespoons chopped onion<br>8 hot dog buns</div><br><div class='instructions'><h3>Instructions</h3><br>1. Preheat the oven to 325 degrees F (165 degrees C).<br>2. Stir hot dogs, Cheddar cheese, relish, ketchup, mustard, and onion together in a bowl; spoon into hot dog buns. Wrap each sandwich in aluminum foil.<br>3. Bake in the preheated oven until hot, about 20 minutes. Serve immediately.</div><br><div class='nutritionalfacts'><br><h3>Nutrition Facts - Hotdog Sandwich</h3><br>1. Calories - 242<br>2. Total Fat - 14.54g, Saturated Fat - 5.109g, Polyunsaturated Fat - 1.706g, Monounsaturated fat - 6.853g<br>3. Cholesterol - 44mg<br>4. Sodium - 670mg<br>5. Total Carbohydrates - 18.03g<br>6. Protein - 10.39g<br>7. Potassium - 143mg<br>8. Vitamin C - 0.1mcg<br>9. Calcium - 24mg<br>10. Iron - 2.31mg</div><br><div class='dietary'><br><h3>Dietary Recommendation</h3><br>After enjoying a hotdog sandwich, balance your diet with lighter options. For breakfast, opt for whole grain toast topped with avocado and sliced tomatoes. For lunch, enjoy a vegetable wrap with hummus and mixed greens. For dinner, savor grilled chicken breast with a side of roasted sweet potatoes and steamed broccoli. Stay hydrated with water or herbal tea, and for a snack, enjoy carrot sticks with Greek yogurt dip or a small handful of almonds.<br><br><a href='https://www.scribd.com/document/528238604/Nutritional-value'>Nutrition facts source</a><br><a href='https://www.allrecipes.com/recipe/214373/baked-hot-dog-sandwiches'>Recipe and ingredients source</a></div>",
    "hotsilog":"<div class='ingredients'><h3>Ingredients</h3><br>3 pieces red hotdogs<br>2 eggs<br>1 cup garlic fried rice<br>1 medium tomato sliced<br>3/4 cup water<br>6 tablespoons cooking oil</div><br><div class='instructions'><h3>Instructions</h3><br>1. Pour water in a small cooking pot. Let boil.<br>2. Add hotdogs and then pour 2 tablespoons cooking oil. Continue to cook until the water evaporates.<br>3. Once the water is gone, fry the hotdogs in the remaining oil for 1 to 2 minutes while slowly rolling it back and forth to prevent it from getting burnt. Set aside.<br>4. Prepare the eggs by heating 4 tablespoons of cooking oil in a pan.<br>5. Once the oil gets hot, crack a piece of egg and start to fry it. As the egg is frying, grab a spoon and scoop the oil from the bottom of the pot. Pour the oil over the egg. Do this until the yolk gets a white covering. Remove the egg and set aside.Do the same step on the other piece of egg.<br>6. Arrange the garlic fried rice, hotdogs, and fried eggs in a plate. Put the slices of tomato on the side.<br>7. Serve with ketchup.</div></div><br><div class='nutritionalfacts'><br><h3>Nutrition Facts - Hotsilog</h3><br>1. Calories - 307.3<br>2. Total Fat - 25.9g<br>3. Cholesterol - 223.3mg<br>4. Sodium - 852.2mg<br>5. Total Carbohydrates - 3.7g<br>6. Protein - 14.3g<br>7. Potassium - 152.1mg</div></div><br><div class='dietary'><br><h3>Dietary Recommendation</h3><br>After enjoying hotsilog, balance your diet with lighter options. For breakfast, opt for a vegetable omelette with whole grain toast and sliced avocado. For lunch, enjoy a mixed salad with grilled chicken and a light vinaigrette dressing. For dinner, savor grilled fish with steamed vegetables and a small portion of brown rice. Stay hydrated with water or herbal tea, and for a snack, enjoy sliced cucumber with hummus or a small handful of nuts.<br><br><a href='https://www.scribd.com/document/528238604/Nutritional-value'>Nutrition facts source</a><br><a href='https://panlasangpinoy.com/hotsilog-hotdog-sinangang-at-itlog'>Recipe and ingredients source</a></div>",
    "ice_cream":"<div class='ingredients'><h3>Ingredients</h3><br>1 cup milk<br>1/2 cup sugar<br>2 cups thickened cream<br>1-2 tsp vanilla extract</div><br><div class='instructions'><h3>Instructions</h3><br>1. In a medium bowl combine milk and sugar, and stir until all the sugar has dissolved. Stir in the thickened cream and vanilla to taste.<br>2. Remove the bowl from the freezer, assemble the maker and turn it on. While it's running, pour the milk and cream mixture into the freezer bowl through the ingredient spout.<br>3. Let the ice cream machine mix until the mixture thickens - this will take about 25-30 minutes.<br>4. Transfer the ice cream to a container and freeze till it firms. (This is optional. If you prefer your ice cream soft, it can be eaten immediately).</div><br><div class='nutritionalfacts'><br><h3>Nutrition Facts - Ice Cream</h3><br>1. Calories - 267<br>2. Total Fat - 14.26g, Saturated Fat - 8.801g, Polyunsaturated Fat - 0.575g, Monounsaturated fat - 3.897g<br>3. Cholesterol - 53mg<br>4. Sodium - 98mg<br>5. Total Carbohydrates - 32.45g, Dietary Fiber - 0.9g, Sugars - 29.66g<br>6. Protein - 4.68g<br>7. Potassium - 269mg<br>8. Vitamin C - 0.8mcg<br>9. Vitamin A - 146mcg<br>10. Calcium - 168mg<br>11. Iron - 0.19mg</div><br><div class='dietary'><br><h3>Dietary Recommendation</h3><br>After indulging in ice cream, balance your diet with lighter options. For breakfast, enjoy Greek yogurt with granola and fresh berries. For lunch, opt for a quinoa salad with mixed greens, grilled vegetables, and a lemon vinaigrette. For dinner, savor grilled salmon with roasted sweet potatoes and steamed asparagus. Keep hydrated with water or herbal tea, and for a snack, enjoy apple slices with almond butter or a small handful of trail mix.<br><br><a href='https://mobile.fatsecret.com/calories-nutrition/generic/ice-cream'>Nutrition facts source</a><br><a href='https://www.taste.com.au/recipes/ice-cream-basic-recipe/e1460150-724b-4c03-9ae6-89a66640905d'>Recipe and ingredients source</a></div>",
    "kaldereta":"<div class='ingredients'><h3>Ingredients</h3><br>2 lbs. Pork sliced into cubes<br>1 piece Knorr Pork cube<br>8 oz. tomato sauce<br>¾ cup green olives<br>1 piece red bell pepper sliced<br>1 piece green bell pepper sliced<br>2 pieces potatoes cubed<br>2 pieces carrot sliced<br>1 piece onion chopped<br>3 cloves garlic chopped<br>1 1/2 cups water<br>½ cup liver spread<br>3 tablespoons cooking oil<br>Salt and ground black pepper to taste</div><br><div class='instructions'><h3>Instructions</h3><br>1. Heat the oil in a cooking pot.<br>2. Once the oil gets hot, saute the garlic and onion.<br>3. Add the pork. Saute until the color turns light brown.<br>4. Pour-in the tomato sauce and water. Let boil. Cover and cook in low heat for 60 minutes.<br>5. Add the liver spread. Stir and cook for 3 minutes.<br>6. Put-in the potato and carrot. Cover and cook for 8 to 10 minutes.<br>7. Add the olives and bell peppers. Cook for 5 minutes.<br>8. Season with salt and ground black pepper.<br>9. Turn-off the heat. Transfer to a serving plate.</div><br><div class='nutritionalfacts'><br><h3>Nutrition Facts - Kaldereta</h3><br>1. Calories - 448kcal<br>2. Carbohydrates - 21g, Fiber - 5g, Sugar - 7g<br>3. Protein - 40g<br>4. Fat - 22g, Saturated Fat - 5g<br>5. Cholesterol - 106mg<br>6. Sodium - 829mg<br>7. Potassium - 1325mg<br>8. Vitamin A - 5105 IU<br>9. Vitamin C - 64.3mg<br>10. Calcium - 155mg<br>11. Iron - 6.9mg</div><br><div class='dietary'><br><h3>Dietary Recommendation</h3><br>After enjoying kaldereta, balance your diet with lighter options. For breakfast, opt for oatmeal topped with sliced bananas and a sprinkle of cinnamon. For lunch, enjoy a vegetable stir-fry with tofu and a side of brown rice. For dinner, savor grilled fish with a mixed salad of lettuce, tomatoes, and cucumber. Stay hydrated with water or coconut water, and for a snack, munch on air-popped popcorn or enjoy a piece of fresh fruit like mango or pineapple.<br><br><a href='https://www.kawalingpinoy.com/beef-caldereta/'>Nutrition facts source</a><br><a href='https://panlasangpinoy.com/pork-caldereta'>Recipe and ingredients source</a></div>",
    "kare-kare":"<div class='ingredients'><h3>Ingredients</h3><br>4 lbs. pork belly<br>5 cups water<br>3 tablespoons salt<br>3 cups cooking oil<br>1/2 cup bagoong alamang<br>2 cups roasted peanuts<br>1 piece Knorr Pork Cube<br>1/2 cup annatto seeds<br>1 piece onion chopped<br>3 cloves garlic minced<br>1 ½ tablespoons toasted rice powder<br>2 cups water<br>3 tablespoons cooking oil<br>2 bunches pechay<br>1 piece eggplant sliced<br>12 pieces string beans<br>1 cup banana blossoms sliced</div><br><div class='instructions'><h3>Instructions</h3><br>1. Prepare the pork. Boil water in a large cooking pot. Add pork. Continue boiling for 35 minutes. Remove the pork from the pot and let it cook down. Rub salt all over and let it stay for 5 minutes.<br>2. Heat oil in a large pan. Once the oil gets really hot, fry the pork belly (skin side down). Note: BE CAREFUL! Splash 1 1/2 tablespoons of water on the oil every 3 minutes or until the skin gets golden brown and very crispy.<br>3. Flip the pork and continue frying until the opposite side turns golden brown. Remove pork from the cooking pot and place it over a wire rack to let the excess oil drip. Set aside.<br>4. Start to make the sauce. Grind the peanuts using a food processor until the texture becomes paste-like. Set aside.<br>5. Make annatto water by soaking annatto seeds in hot water for 5 minutes. Constantly stir until the water turns deep orange. Filter the water using a kitchen strainer. You may discard the seeds afterwards. Set aside.<br>6. Heat oil in a pan. Saute garlic and onion. Once the onion softens, add the peanut paste. Stir and cook for 1 minute.<br>7. Pour water and then stir until the mixture becomes smooth. Let the liquid boil.<br>8. Add Knorr Pork Cube and annatto water. Cover and continue cooking for 3 minutes. Remove the cover and cook until the mixture reduces to your desired consistency. Add toasted rice powder. Mix well. Turn off the heat. Make sure to cover the pot tokeep the sauce warm.<br>9. Cook the vegetables by steaming. Arrange string bean, banana blossom, and eggplant on a steamer. Steam for 5 minutes. Add pechay and continue steaming for 2 to 3 minutes.<br>10. Assemble your crispy kare-kare by combining the sauce, steamed vegetables, and crispy pork in one plate. Serve with rice and bagoong alamang. Share and enjoy!</div><br><div class='nutritionalfacts'><br><h3>Nutrition Facts - Kare-kare</h3><br>1. Calories - 698.7kcal<br>2. Carbohydrates - 70.4<br>3. Protein - 22.5g<br>4. Fat - 36.3g<br>5. Sodium - 321mg<br>6. Calcium - 165.7mg<br>7. Iron - 4.8mg</div><br><div class='dietary'><br><h3>Dietary Recommendation</h3><br>After enjoying kare-kare, balance your diet with lighter options. For breakfast, opt for a fruit smoothie with spinach, banana, and almond milk. For lunch, enjoy a mixed vegetable stir-fry with tofu and a side of brown rice. For dinner, savor grilled fish with a side of steamed vegetables and quinoa. Stay hydrated with water or coconut water, and for a snack, munch on air-popped popcorn or enjoy a piece of fresh fruit like mango or pineapple.<br><br><a href='https://www.ajinomoto.com.ph/ajinomoto-static/kare-kare-bagoong-rice/index.html'>Nutrition facts source</a><br><a href='https://panlasangpinoy.com/crispy-kare-kare-recipe'>Recipe and ingredients source</a></div>",
    "kinilaw":"<div class='ingredients'><h3>Ingredients</h3><br>2 lbs. Tanigue Wahoo fish, fillet and cut into cubes<br>2 thumbs fresh ginger minced<br>8 pieces hot chili Thai chili or siling labuyo, chopped<br>15 to 20 pieces calamansi<br>1 medium red onion chopped into small pieces<br>¼ teaspoon ground black pepper<br>½ teaspoon sugar<br>Salt to taste</div><br><div class='instructions'><h3>Instructions</h3><br>1. Squeeze the juice out of the calamansi over a large bowl. Use a sieve to filter the seeds. Discard the seeds.<br>2. In the bowl with calamansi juice, add sugar, ½ teaspoon salt, and ground black pepper. Stir until the sugar and salt are diluted.<br>3. Add the ginger, chili, and onion. Stir for a few seconds until all ingredients are well blended.<br>4. Arranged the raw fish cubes in a large bowl. Pour the calamansi mixture. Toss until the fish cubes are coated. Let is stay for 10 minutes.<br>5. Toss one more time and taste. Add more salt if needed. You can also add more calamansi juice if needed. Toss to blend all the ingredients. Securely cover the bowl and place it inside the refrigerator. Let it chill for at least 3 hours.</div><br><div class='nutritionalfacts'><br><h3>Nutrition Facts - Kinilaw</h3><br>1. Calories - 93.7kcal<br>2. Carbohydrates - 2.7<br>3. Protein - 17.8g<br>4. Fat - 1.3g<br>5. Fiber - 0.3g<br>6. Sodium - 349.4mg<br>7. Calcium - 42.5mg<br>8. Iron - 1.4mg</div><br><div class='dietary'><br><h3>Dietary Recommendation</h3><br>After indulging in kinilaw, balance your diet with lighter options. For breakfast, opt for a fruit salad with Greek yogurt and a drizzle of honey. For lunch, enjoy a mixed green salad with grilled shrimp and a light vinaigrette dressing. For dinner, savor grilled chicken breast with a side of roasted vegetables and quinoa. Stay hydrated with water or herbal tea, and for a snack, enjoy carrot sticks with hummus or a small handful of nuts.<br><br><a href='https://www.cookmunitybyajinomoto.com/recipes/kinilaw-na-tanigue-2'>Nutrition facts source</a><br><a href='https://panlasangpinoy.com/kinilaw-na-tanigue-recipe-fish-ceviche'>Recipe and ingredients source</a></div>",
    "laing":"<div class='ingredients'><h3>Ingredients</h3><br>4 ounces taro leaves dried<br>1/2 lb. pork cut into thin strips<br>1/2 lb. shrimp with head (optional)<br>1/2 cup shrimp paste<br>1 onion chopped<br>6 Thai chili pepper<br>1/4 cup ginger cut into strips<br>1 tbsp garlic minced<br>4 cups coconut milk<br>fish sauce and ground black pepper to taste</div><br><div class='instructions'><h3>Instructions</h3><br>1. In a large pan, pour-in the coconut milk and bring to a boil<br>2. Add the garlic, onion, and ginger. Cook for 10 minutes<br>3. Add the pork meat and shrimp paste and stir continuously<br>4. Put in the Thai chili and simmer for another 10 minutes<br>5. Add the fish sauce and dried Taro leaves and simmer for 40 to 60. Add water if needed.<br>6. Put the shrimps in and cook for for 5 minutes. Season with ground black pepper.</div><br><div class='nutritionalfacts'><br><h3>Nutrition Facts - Laing</h3><br>1. Calories - 351kcal<br>2. Carbohydrates - 14.36g, Fiber - 5g, Sugar - 6.06g<br>3. Protein - 19.9g<br>4. Fat - 25.85g, Saturated Fat - 5g, Polyunsaturated Fat - 4.827g, Monounsaturated Fat - 19.604g<br>5. Cholesterol - 199mg<br>6. Sodium - 499mg<br>7. Potassium - 1649mg</div><br><div class='dietary'><br><h3>Dietary Recommendation</h3><br>After relishing laing, balance your diet with lighter options. For breakfast, opt for scrambled eggs with spinach and tomatoes served with whole grain toast. For lunch, enjoy a mixed salad with grilled tofu and a light vinaigrette dressing. For dinner, savor grilled fish with steamed vegetables and a small portion of brown rice. Stay hydrated with water or herbal tea, and for a snack, enjoy sliced cucumber with Greek yogurt dip or a small handful of almonds.<br><br><a href='https://www.fatsecret.co.za/calories-nutrition/generic/laing'>Nutrition facts source</a><br><a href='https://panlasangpinoy.com/laing'>Recipe and ingredients source</a></div>",
    "lasagna":"<div class='ingredients'><h3>Ingredients</h3><br>250 grams of pasta preferably whole wheat<br>500 grams of minced meat<br>2 tablespoons olive or sesame oil<br>½ onion chopped<br>1 teaspoon garlic minced<br>1 packet of cheese sauce<br>Cheese as needed grated<br>Salt and pepper to taste</div><br><div class='instructions'><h3>Instructions</h3><br>1. Fill a pot with water and bring to a boil. Sprinkle a pinch of salt in water and toss is the pasta.<br>2. While the pasta cooks, heat 2 tablespoons of olive oil in a pan. Sauté the onions and garlic for 5 minutes. Add minced meat and seasoning, and cook until brown and soft. Remove from heat.<br>3. When the pasta is cooked but still slightly undercooked, remove from heat and drain the water. Wait for it to cool. Layer the bottom of a casserole dish with the al dente pasta. Add the meat and pat the surface with a spatula to make sure it islevel.<br>4. Pour the cheese sauce on top of the meat and level with a spoon. Finally, sprinkle the grated cheese, making sure the top is fully covered.<br>5. Bake in 360F until the cheese on top turns golden brown. Serve.</div><br><div class='nutritionalfacts'><br><h3>Nutrition Facts - Lasagna</h3><br>1. Calories - 336kcal<br>2. Carbohydrates - 35.43g, Fiber - 2.7g, Sugar - 5.6g<br>3. Protein - 20.52g<br>4. Fat - 12.38g, Saturated Fat - 6.384g, Polyunsaturated Fat - 0.688g, Monounsaturated Fat - 4.038g<br>5. Cholesterol - 49mg<br>6. Sodium - 744mg<br>7. Potassium - 391mg<br>8. Vitamin A - 74mcg<br>9. Vitamin C - 7.2mg<br>10. Calcium - 247mg<br>11. Iron - 2.86mg</div><br><div class='dietary'><br><h3>Dietary Recommendation</h3><br>After indulging in lasagna, balance your diet with lighter, Filipino-inspired options. For breakfast, enjoy a bowl of champorado (chocolate rice porridge) made with cocoa powder and coconut milk, topped with a sprinkle of toasted pinipig (crisped rice). For lunch, savor a vegetable sinigang (sour soup) with shrimp or fish, accompanied by a serving of steamed white rice. For dinner, opt for grilled bangus (milkfish) served with ensaladang talong (eggplant salad) and a side of steamed okra. Stay hydrated with water or fresh buko juice, and for a snack, enjoy sliced mango or pineapple for a refreshing treat.<br><br><a href='https://mobile.fatsecret.com/calories-nutrition/generic/lasagna-with-meat'>Nutrition facts source</a><br><a href='https://panlasangpinoy.com/how-to-make-lasagna'>Recipe and ingredients source</a></div>",
    "leche_flan":"<div class='ingredients'><h3>Ingredients</h3><br>10 pieces eggs<br>1 can condensed milk (14 oz)<br>1 cup fresh milk or evaporated milk<br>1 cup granulated sugar<br>1 teaspoon vanilla extract</div><br><div class='instructions'><h3>Instructions</h3><br>1. Using all the eggs, separate the yolk from the egg white (only egg yolks will be used).<br>2. Place the egg yolks in a big bowl then beat them using a fork or an egg beater<br>3. Add the condensed milk and mix thoroughly<br>4. Pour-in the fresh milk and Vanilla. Mix well<br>5. Put the mold (llanera) on top of the stove and heat using low fire<br>6. Put-in the granulated sugar on the mold and mix thoroughly until the solid sugar turns into liquid (caramel) having a light brown color. Note: Sometimes it is hard to find a Llanera (Traditional flan mold) depending on your location. I find itmore convenient to use individual Round Pans in making leche flan.<br>7. Spread the caramel (liquid sugar) evenly on the flat side of the mold<br>8. Wait for 5 minutes then pour the egg yolk and milk mixture on the mold<br>9. Cover the top of the mold using an Aluminum foil<br>10. Steam the mold with egg and milk mixture for 30 to 35 minutes.<br>11. After steaming, let the temperature cool down then refrigerate<br>12. Serve for dessert. Share and Enjoy!</div><br><div class='nutritionalfacts'><br><h3>Nutrition Facts - Leche Flan</h3><br>1. Calories - 239kcal<br>2. Carbohydrates - 31g, Sugar - 30g<br>3. Protein - 7g<br>4. Fat - 10g, Saturated Fat - 5g<br>5. Cholesterol - 215mg<br>6. Sodium - 82mg<br>7. Potassium - 231mg<br>8. Vitamin A - 418 IU<br>9. Vitamin C - 1mg<br>10. Calcium - 194mg<br>11. Iron - 1mg</div><br><div class='dietary'><br><h3>Dietary Recommendation</h3><br>After indulging in leche flan, balance your diet with lighter options. For breakfast, enjoy a bowl of arroz caldo (rice porridge) topped with shredded chicken, garlic, and green onions. For lunch, savor a mixed vegetable sinigang (sour soup) with pork ribs or shrimp, accompanied by a serving of steamed white rice. For dinner, opt for grilled tilapia served with a side of ensaladang talong (grilled eggplant salad) and a small portion of brown rice. Stay hydrated with water or fresh buko juice, and for a snack, enjoy sliced mango or pineapple for a refreshing treat.<br><br><a href='https://www.kawalingpinoy.com/leche-flan'>Nutrition facts source</a><br><a href='https://panlasangpinoy.com/leche-flan'>Recipe and ingredients source</a></div>",
    "lechon_kawali":"<div class='ingredients'><h3>Ingredients</h3><br>2 lbs. pork belly<br>1 piece Knorr pork cube<br>5 pieces dried bay leaves<br>1 tablespoon whole peppercorn<br>¼ cup Knorr Liquid Seasoning<br>8 to 10 cups water<br>4 cups cooking oil</div><br><div class='instructions'><h3>Instructions</h3><br>1. Boil water in a cooking pot.<br>2. Add whole peppercorn, bay leaves, and Knorr Pork Cube. Stir.<br>3. Add the pork belly. Cover the pot and continue to boil in medium heat for 45 minutes. You can add more water if needed.<br>4. Remove the pork belly from the cooking pot and place in a clean plate. Let it cool down. Note: you can keep the pork stock for later use. This can be consumed to cook pork based soups and stews.<br>5. Rub Knorr liquid seasoning all over the boiled pork belly. Let it stay for 30 minutes.<br>6. Heat oil in a deep cooking pot. Once the oil gets hot enough (300F), gently put the pork belly into the pot. Deep-fry the pork in medium heat for 7 to 10 minutes. Note: make sure to partially cover the pot or use a splatter screen to protect yourselffrom the oil.<br>7. Turn the pork belly over. Continue to fry the opposite side for 8 minutes or until the skin gets crisp and brown.<br>8. Remove the crispy deep fried pork belly (lechon kawali) from the cooking pot. Arrange in a plate with wire rack or paper towel. Let it cool down. Slice the pork into serving pieces.<br>9. Transfer to a serving plate. Serve with your favorite sauce.</div><br><div class='nutritionalfacts'><br><h3>Nutrition Facts - Lechon Kawali</h3><br>1. Calories - 893kcal<br>2. Carbohydrates - 2g, Fiber - 1g<br>3. Protein - 14g<br>4. Fat - 91g, Saturated Fat - 30g<br>5. Cholesterol - 108mg<br>6. Sodium - 2382mg<br>7. Potassium - 324mg<br>8. Vitamin A - 85 IU<br>9. Vitamin C - 0.8mg<br>10. Calcium - 34mg<br>11. Iron - 1.5mg</div><br><div class='dietary'><br><h3>Dietary Recommendation</h3><br>After enjoying lechon kawali, balance your diet with lighter options. For breakfast, savor a bowl of lugaw (rice porridge) with slices of boiled egg and a dash of calamansi juice. For lunch, enjoy a mixed vegetable pinakbet (stir-fry) with shrimp or tofu, served with a side of steamed white rice. For dinner, opt for grilled chicken inasal served with ensaladang talong (grilled eggplant salad) and a small portion of brown rice. Stay hydrated with water or fresh buko juice, and for a snack, enjoy sliced mango or pineapple for a refreshing treat.<br><br><a href='https://panlasangpinoy.com/lechon-kawali'>Nutrition facts source</a><br><a href='https://panlasangpinoy.com/filipino-lechon-kawali'>Recipe and ingredients source</a></div>",
    "liempo":"<div class='ingredients'><h3>Ingredients</h3><br>2 1/2 lbs pork belly<br>3 tablespoons Knorr SavorRich Pork Liquid Seasoning<br>5 tablespoons soy sauce<br>3 tablespoons banana ketchup<br>1/2 piece lemon or 3 pieces calamansi<br>1/2 teaspoon ground black pepper<br>5 cloves garlic crushed<br>4 tablespoons soy sauce<br>2 tablespoons banana ketchup<br>1 teaspoon lemon juice<br>1 tablespoon cooking oil</div><br><div class='instructions'><h3>Instructions</h3><br>1. Arrange pork belly in a large bowl. Add all marinade ingredients including Knorr SavorRich Pork Liquid Seasoning. Mix well. Let it stay for at least 30 minutes.<br>2. Prepare the basting sauce by combining all basting sauce ingredients in a bowl. Stir until well blended. Set aside.<br>3. Heat-up the grill. Start to grill the marinated liempo for 3 minutes. Brush basting sauce on the top part and the turn it. Baste and grill the opposite side for 3 minutes. Perform these steps with the same duration of grilling until the liempogets medium brown. Note: it usually takes 3 cycles to completely cook the pork belly.<br>4. Remove from the grill. Let the liempo cool down. Slice into serving pieces.<br>5. Serve with spicy vinegar and papaya atchara.</div><br><div class='nutritionalfacts'><br><h3>Nutrition Facts - Liempo</h3><br>1. Calories - 222kcal<br>2. Carbohydrates - 26g, Fiber - 0.3g, Sugar - 22g<br>3. Protein - 16g<br>4. Fat - 7g, Saturated Fat - 2g, Polyunsaturated Fat - 1g, Monounsaturated Fat - 3g, Trans Fat - 0.01g<br>5. Cholesterol - 46mg<br>6. Sodium - 2068mg<br>7. Potassium - 400mg<br>8. Vitamin A - 164 IU<br>9. Vitamin C - 5mg<br>10. Calcium - 26mg<br>11. Iron - 2mg</div><br><div class='dietary'><br><h3>Dietary Recommendation</h3><br>After indulging in liempo, balance your diet with lighter options. For breakfast, enjoy a bowl of champorado (chocolate rice porridge) topped with a sprinkle of toasted pinipig (crisped rice) or a slice of ripe mango. For lunch, savor a mixed vegetable sinigang (sour soup) with pork ribs or shrimp, accompanied by a serving of steamed white rice. For dinner, opt for grilled fish served with a side of ensaladang talong (grilled eggplant salad) and a small portion of brown rice. Stay hydrated with water or fresh buko juice, and for a snack, enjoy sliced pineapple or watermelon for a refreshing treat.<br><br><a href='https://www.manilaspoon.com/inihaw-na-liempo-pinoy-pork-barbecue'>Nutrition facts source</a><br><a href='https://panlasangpinoy.com/easy-liempo-inihaw'>Recipe and ingredients source</a></div>",
    "longganisa":"<div class='ingredients'><h3>Ingredients</h3><br>1 ¾ lbs. ground pork<br>9 tablespoons dark brown sugar<br>1 tablespoon smoked paprika<br>3 tablespoons vegetable oil<br>1 ¼ tablespoons coarse salt<br>1 teaspoon ground black pepper<br>2 head garlic</div><br><div class='instructions'><h3>Instructions</h3><br>1. Peel the skin off the garlic cloves. Crush thoroughly using mortar and pestle. Mince the crushed garlic. Set aside.<br>2. In a large mixing bowl, combine ground pork along with all of the ingredients. Mix well.<br>3. Cover the bowl. Refrigerate for 2 hours.<br>4. Shape the longganisa by laying a sheet of wax paper on a flat surface. Scoop around 3 tablespoons of mixture and put over the wax paper. Fold the wax paper from top to down until the mixture covered. Hold the edge of the paper with your fingersand then slide the card towards the mixture. Push a bit more until a sausage shape is formed. Do this step until the entire mixture is consumed.<br>5. Refrigerate overnight.<br>6. Cook and serve for breakfast.</div><br><div class='nutritionalfacts'><br><h3>Nutrition Facts - Longganisa</h3><br>1. Calories - 603kcal<br>2. Carbohydrates - 10g, Fiber - 0.2g, Sugar - 9g<br>3. Protein - 13g<br>4. Fat - 56g, Saturated Fat - 21g, Polyunsaturated Fat - 6g, Monounsaturated Fat - 26g, Trans Fat - 0.01g<br>5. Cholesterol - 90mg<br>6. Sodium - 795mg<br>7. Potassium - 252mg<br>8. Vitamin A - 89 IU<br>9. Vitamin C - 1mg<br>10. Calcium - 25mg<br>11. Iron - 1mg</div><br><div class='dietary'><br><h3>Dietary Recommendation</h3><br>After indulging in longganisa, balance your diet with lighter options. For breakfast, enjoy a serving of arroz caldo (rice porridge) with shredded chicken and a side of sliced tomatoes. For lunch, savor a mixed vegetable sinigang (sour soup) with pork ribs or shrimp, accompanied by a serving of steamed white rice. For dinner, opt for grilled chicken adobo served with a side of ensaladang talong (grilled eggplant salad) and a small portion of brown rice. Stay hydrated with water or fresh buko juice, and for a snack, enjoy sliced mango or pineapple for a refreshing treat.<br><br><a href='https://www.manilaspoon.com/inihaw-na-liempo-pinoy-pork-barbecue'>Nutrition facts source</a><br><a href='https://panlasangpinoy.com/skinless-longganisa-recipe'>Recipe and ingredients source</a></div>",
    "lumpia":"<div class='ingredients'><h3>Ingredients</h3><br>50 pieces lumpia wrapper<br>3 cups cooking oil<br>1 1/2 lbs ground pork<br>2 pieces onion minced<br>2 pieces carrots minced<br>1 1/2 teaspoons garlic powder<br>1/2 teaspoon ground black pepper<br>1/2 cup parsley chopped<br>1 1/2 teaspoons salt<br>1 tablespoon sesame oil<br>2 eggs</div><br><div class='instructions'><h3>Instructions</h3><br>1. Combine all filling ingredients in a bowl. Mix well.<br>2. Scoop around 1 to 1 1/2 tablespoons of filling and place over a piece of lumpia wrapper. Spread the filling and then fold both sides of the wrapper. Fold the bottom. Brush beaten egg mixture on the top end of the wrapper. Roll-up until completelywrapped. Perform the same step until all mixture are consumed.<br>3. Heat oil in a cooking pot. Deep fry lumpia in medium heat until it floats.<br>4. Remove from the pot. Let excess oil drip. Serve.</div><br><div class='nutritionalfacts'><br><h3>Nutrition Facts - Lumpia</h3><br>1. Calories - 183kcal<br>2. Carbohydrates - 3g, Fiber - 1g, Sugar - 1g<br>3. Protein - 4g<br>4. Fat - 18g, Saturated Fat - 2g<br>5. Cholesterol - 20mg<br>6. Sodium - 189mg<br>7. Potassium - 152mg<br>8. Vitamin A - 535 IU<br>9. Vitamin C - 0.9mg<br>10. Calcium - 5mg<br>11. Iron - 0.4mg</div><br><div class='dietary'><br><h3>Dietary Recommendation</h3><br>After enjoying lumpia, balance your diet with lighter options. For breakfast, savor a bowl of champorado (chocolate rice porridge) topped with toasted pinipig (crisped rice) or a slice of ripe mango. For lunch, enjoy a mixed vegetable sinigang (sour soup) with shrimp or tofu, served with a side of steamed white rice. For dinner, opt for grilled fish served with a side of ensaladang talong (grilled eggplant salad) and a small portion of brown rice. Stay hydrated with water or fresh buko juice, and for a snack, enjoy sliced pineapple or watermelon for a refreshing treat.<br><br><a href='https://www.kawalingpinoy.com/lumpia-shanghai'>Nutrition facts source</a><br><a href='https://panlasangpinoy.com/filipino-lumpia-recipe'>Recipe and ingredients source</a></div>",
    "pancakes":"<div class='ingredients'><h3>Ingredients</h3><br>1 cup all-purpose flour<br>2 tablespoons white sugar<br>2 teaspoons baking powder<br>1 teaspoon salt, or to taste<br>1 cup milk<br>2 tablespoons vegetable oil<br>1 egg, beaten</div><br><div class='instructions'><h3>Instructions</h3><br>1. Combine flour, sugar, baking powder, and salt in a large bowl. Make a well in the center, and pour in milk, oil, and egg. Mix until smooth.<br>2. Heat a lightly oiled griddle or frying pan over medium-high heat. Pour or scoop batter onto the griddle, using approximately 1/4 cup for each pancake; cook until bubbles form and the edges are dry, 1 to 2 minutes. Flip and cook until browned onthe other side. Repeat with remaining batter.<br>3. Serve hot and enjoy!</div><br><div class='nutritionalfacts'><br><h3>Nutrition Facts - Pancakes</h3><br>1. Calories - 86kcal<br>2. Carbohydrates - 10.75g<br>3. Protein - 2.43g<br>4. Fat - 3.69g, Saturated Fat - 0.806g, Polyunsaturated Fat - 1.69g, Monounsaturated Fat - 0.94g<br>5. Cholesterol - 22mg<br>6. Sodium - 167mg<br>7. Potassium - 50mg<br>8. Vitamin A - 21mcg<br>9. Vitamin C - 0.1mg<br>10. Calcium - 83mg<br>11. Iron - 0.68mg</div><br><div class='dietary'><br><h3>Dietary Recommendation</h3><br>After indulging in pancakes, balance your diet with lighter options. For breakfast, enjoy a bowl of oatmeal topped with sliced bananas and a sprinkle of cinnamon. For lunch, savor a mixed green salad with grilled chicken and a light vinaigrette dressing. For dinner, opt for grilled salmon with roasted vegetables and a small portion of quinoa. Stay hydrated with water or herbal tea, and for a snack, enjoy apple slices with almond butter or a small handful of nuts.<br><br><a href='https://www.kawalingpinoy.com/lumpia-shanghai'>Nutrition facts source</a><br><a href='https://www.allrecipes.com/recipe/45396/easy-pancakes'>Recipe and ingredients source</a></div>",
    "pancit_canton":"<div class='ingredients'><h3>Ingredients</h3><br>250 grams flour stick noodles<br>4 ounces pork thinly sliced<br>1 piece Chinese sausage sliced<br>1 piece onion sliced<br>1 teaspoon garlic minced<br>8 to 10 pieces shrimp shell removed<br>10 to 12 pieces snap peas<br>3/4 cup carrot julienne<br>1 piece cabbage small, chopped<br>1 1/2 cups chicken broth<br>1 tablespoon oyster sauce opional<br>3 tablespoons soy sauce<br>3/4 cup water<br>1/2 cup flat leaf parsley chopped<br>3 tablespoons cooking oil<br>Salt and pepper to taste</div><br><div class='instructions'><h3>Instructions</h3><br>1. Place 2 cups of ice and 3 cups water in a large bowl. Set aside.<br>2. Boil 6 cups of water in a cooking pot.<br>3. Once the water starts to boil, blanch the snap peas, carrots, and cabbage for 35 to 50 seconds. Quickly remove the vegetables and immerse in bowl with ice cold water. Drain the water after 2 minutes and set aside.<br>4. Heat a large wok or cooking pot and pour-in the cooking oil.<br>5. Saute the onion and garlic.<br>6. Add the pork and sausage slices and continue to cook for 2 minutes.<br>7. Add-in soy sauce and oyster sauce. Stir.<br>8. Pour-in chicken broth and water. Add salt and pepper. Let boil. continue to cook for 5 to 10 minutes.<br>9. Put-in the shrimp and parsley. Cook for 3 minutes. Add more water if needed.<br>10. Put-in the flour noodles. Gently toss until the noodles absorb the liquid.<br>11. Add-in the blanched vegetables. Toss and cook for 1 to 2 minutes.<br>12. Transfer to a serving plate. Serve.</div><br><div class='nutritionalfacts'><br><h3>Nutrition Facts - Pancit Canton</h3><br>1. Calories - 558kcal<br>2. Carbohydrates - 63g, Fiber - 6g, Sugar - 5g<br>3. Protein - 29g<br>4. Fat - 21g, Saturated Fat - 4g<br>5. Cholesterol - 62mg<br>6. Sodium - 1993mg<br>7. Potassium - 746mg<br>8. Vitamin A - 2205 IU<br>9. Vitamin C - 54.8mg<br>10. Calcium - 157mg<br>11. Iron - 4.4mg</div><br><div class='dietary'><br><h3>Dietary Recommendation</h3><br>After enjoying pancit canton, balance your diet with lighter options. For breakfast, savor a bowl of arroz caldo (rice porridge) with shredded chicken and a side of sliced tomatoes. For lunch, enjoy a mixed vegetable sinigang (sour soup) with pork ribs or shrimp, accompanied by a serving of steamed white rice. For dinner, opt for grilled chicken adobo served with a side of ensaladang talong (grilled eggplant salad) and a small portion of brown rice. Stay hydrated with water or fresh buko juice, and for a snack, enjoy sliced mango or pineapple for a refreshing treat.<br><br><a href='https://www.kawalingpinoy.com/pancit-canton'>Nutrition facts source</a><br><a href='https://panlasangpinoy.com/pancit-canton-recipe'>Recipe and ingredients source</a></div>",
    "pancit_guisado":"<div class='ingredients'><h3>Ingredients</h3><br>1/2 lb pancit bihon<br>1 piece Knorr Shrimp Cube<br>1/2 lb. chicken thigh boiled and shredded<br>8 pieces shrimp shell and head removed<br>1/2 piece small cabbage chopped<br>3/4 cup carrot julienne<br>3 pieces stalks celery chopped<br>3/4 cup sliced long green beans<br>1 piece onion sliced into thin pieces<br>5 tablespoons dark soy sauce<br>2 pieces Chinese sausage chopped<br>5 cloves garlic crushed<br>1/2 cup chopped parsley<br>1/4 teaspoon ground black pepper<br>4 tablespoons cooking oil<br>4 cups water</div><br><div class='instructions'><h3>Instructions</h3><br>1. Soak pancit bihon in water for 8 to 10 minutes. Drain water and set noodles aside.<br>2. Heat oil in a pot. Pan-fry shrimp for 1 minute per side. Remove and set aside.<br>3. Saute onion and garlic using remaining cooking oil. Add Chinese sausage. Cook for 1 minute.<br>4. Add shredded chicken and celery. Cook for 1 to 2 minutes.<br>5. Add Knorr Shrimp Cube. Crush the cube and continue to saute for 30 seconds.<br>6. Pour-in soy sauce. Add parsley, carrot, green beans, and cabbage. Stir. Cover and cook for 3 minutes using medium heat.<br>7. Add pancit. Toss ingredients using a kitchen tong.<br>8. Season with ground black pepper and add the shrimp back. Toss until well blended. Cover the pot and continue to cook for 2 to 5 minutes between low to medium heat.<br>9. Transfer to a serving plate. Serve.</div><br><div class='nutritionalfacts'><br><h3>Nutrition Facts - Pancit Guisado</h3><br>1. Calories - 193kcal<br>2. Carbohydrates - 5g, Sugar - 1g<br>3. Protein - 8g<br>4. Fat - 15g, Saturated Fat - 2g<br>5. Cholesterol - 40mg<br>6. Sodium - 898mg<br>7. Potassium - 197mg<br>8. Vitamin A - 2705 IU<br>9. Vitamin C - 3.1mg<br>10. Calcium - 27mg<br>11. Iron - 0.7mg</div><br><div class='dietary'><br><h3>Dietary Recommendation</h3><br>After relishing pancit guisado, balance your diet with lighter options. For breakfast, savor a bowl of champorado (chocolate rice porridge) topped with toasted pinipig (crisped rice) or a slice of ripe mango. For lunch, enjoy a mixed vegetable sinigang (sour soup) with shrimp or tofu, served with a side of steamed white rice. For dinner, opt for grilled fish served with a side of ensaladang talong (grilled eggplant salad) and a small portion of brown rice. Stay hydrated with water or fresh buko juice, and for a snack, enjoy sliced pineapple or watermelon for a refreshing treat.<br><br><a href='https://panlasangpinoy.com/pancit-guisado-recipe-knr-sc'>Source</a></div>",
    "pancit_palabok":"<div class='ingredients'><h3>Ingredients</h3><br>500 grams rice noodles bihon<br>2 tbsp cooking oil<br>1/2 lb ground pork<br>1 tbsp anatto powder<br>3 cups pork broth<br>1 piece shrimp bouillon<br>6 tablespoons all-purpose flour<br>2 tbsp fish sauce<br>1/2 tsp ground black pepper<br>1 cup pork belly boiled and sliced thinly into small pieces<br>4 ounces firm tofu fried and sliced into cubes<br>½ cup tinapa flakes smoked fish<br>½ cup chicharon pounded<br>2 hard boiled eggs sliced<br>½ cup cooked shrimps boiled or steamed<br>1/4 cup green onion or scallions finely chopped<br>3 Tablespoons toasted garlic<br>2 lemons sliced (or 6 pieces calamansi)</div><br><div class='instructions'><h3>Instructions</h3><br>1. Soak the rice noodles in water for about 15 minutes. Drain and set aside.<br>2. Cook the sauce by heating a saucepan. Pour-in the cooking oil.<br>3. When the oil is hot enough, put-in the ground pork and cook for about 5 to 7 minutes<br>4. Dilute the annato powder in pork broth then pour the mixture in the saucepan. Bring to a boil (If you are using anatto seeds, soak them first in 3 tbsp water to bring-out the color)<br>5. Add the shrimp cube and stir and simmer for 3 minutes<br>6. Add the flour gradually while stirring.<br>7. Add the fish sauce and ground black pepper then simmer until sauce becomes thick. Set aside.<br>8. Meanwhile, boil enough water in a pot.<br>9. Place the soaked noodles in a strainer (use metal or bamboo strainer) then submerge the strainer in the boiling water for about a minute or until the noodles are cooked. (make sure that the noodles are still firm)<br>10. Remove the strainer from the pot and drain the liquid from the noodles.<br>11. Place the noodles in the serving plate.<br>12. Pour the sauce on top of the noodles then arrange the toppings over the sauce.<br>13. Serve with a slice of lemon or calamansi.</div><br><div class='nutritionalfacts'><br><h3>Nutrition Facts - Pancit Palabok</h3><br>1. Calories - 679kcal<br>2. Carbohydrates - 81g, Sugar - 1g, Fiber - 3g<br>3. Protein - 27g<br>4. Fat - 26g, Saturated Fat - 8g, Polyunsaturated Fat - 4g, Monounsaturated Fat - 12g, Trans Fat - 1g<br>5. Cholesterol - 132mg<br>6. Sodium - 1174mg<br>7. Potassium - 528mg<br>8. Vitamin A - 184 IU<br>9. Vitamin C - 29mg<br>10. Calcium - 88mg<br>11. Iron - 3mg</div><br><div class='dietary'><br><h3>Dietary Recommendation</h3><br>After indulging in pancit palabok, balance your diet with lighter options. For breakfast, savor a bowl of lugaw (rice porridge) with slices of boiled egg and a dash of calamansi juice. For lunch, enjoy a mixed vegetable pinakbet (stir-fry) with shrimp or tofu, served with a side of steamed white rice. For dinner, opt for grilled chicken inasal served with ensaladang talong (grilled eggplant salad) and a small portion of brown rice. Stay hydrated with water or fresh buko juice, and for a snack, enjoy sliced mango or pineapple for a refreshing treat.<br><a href='https://panlasangpinoy.com/asian-filipino-food-noodles-pansit-pancit-palabok-recipe'>Source</a></div>",
    "pandesal":"<div class='ingredients'><h3>Ingredients</h3><br>2 cups all purpose flour<br>2 cups bread flour<br>1/2 cup white sugar<br>5 tbsp butter melted<br>1 tsp baking powder<br>1 1/4 cup fresh milk warm<br>1 pouch rapid rise yeast<br>1 tsp salt<br>1 cup bread crumbs<br>1 piece raw egg<br>1 tbsp cooking oil</div><br><div class='instructions'><h3>Instructions</h3><br>1. Combine the yeast, sugar, and warm milk and stir until the yeast and sugar are fully dissolved<br>2. In the mixing bowl, combine the dry ingredients starting with the flour then the sugar, salt, and baking powder . Mix well by stirring<br>3. Add the egg, butter, cooking oil, and yeast-sugar-milk mixture in the mixing bowl with the dry ingredients then mix again until a dough is formed. Use your clean hands to effectively mix the ingredients.<br>4. In a flat surface, knead the dough until the texture becomes fine. For faster and easier kneading, you may use a Stand Mixer with dough hook.<br>5. Mold the dough until shape becomes round then put back in the mixing bowl. Cover the mixing bowl with damp cloth and let the dough rise for at least 1 hour<br>6. Put the dough back to the flat surface and divide into 4 equal parts using a dough slicer<br>7. Roll each part until it forms a cylindrical shape<br>8. Slice the cylindrical dough diagonally (These slices will be the individual pieces of the pandesal)<br>9. Roll the sliced dough over the breadcrumbs and place in a baking tray with wax paper (makes sure to provide gaps between dough as this will rise later on)<br>10. Leave the sliced dough with breadcrumbs in the tray for another 10 to 15 minutes to rise<br>11. Pre-heat the oven at 375 degrees Fahrenheit for 10 minutes<br>12. Put the tray with dough in the oven and bake for 15 minutes<br>13. Turn off the oven and remove the freshly baked pandesal.</div><br><div class='nutritionalfacts'><br><h3>Nutrition Facts - Pandesal</h3><br>1. Calories - 138kcal<br>2. Carbohydrates - 24g, Sugar - 4g<br>3. Protein - 3g<br>4. Fat - 2g, Saturated Fat - 1g<br>5. Cholesterol - 19mg<br>6. Sodium - 91mg<br>7. Potassium - 47mg<br>8. Vitamin A - 95 IU<br>10. Calcium - 22mg<br>11. Iron - 1.3mg</div><br><div class='dietary'><br><h3>Dietary Recommendation</h3><br>After indulging in pandesal, balance your diet with lighter options. For breakfast, enjoy a bowl of arroz caldo (rice porridge) topped with shredded chicken and a side of sliced tomatoes. For lunch, savor a mixed vegetable sinigang (sour soup) with pork ribs or shrimp, accompanied by a serving of steamed white rice. For dinner, opt for grilled fish served with a side of ensaladang talong (grilled eggplant salad) and a small portion of brown rice. Stay hydrated with water or fresh buko juice, and for a snack, enjoy sliced mango or pineapple for a refreshing treat.<br><br><a href='https://www.kawalingpinoy.com/pandesal'>Nutrition facts source</a><br><a href='https://panlasangpinoy.com/filipino-food-bread-of-salt-pandesal-recipe'>Recipe and ingredients source</a></div>",
    "pinakbet":"<div class='ingredients'><h3>Ingredients</h3><br>1 lb lechon kawali sliced<br>1 piece Knorr Shrimp Cube<br>12 pieces sitaw cut into 2 inch length<br>1/2 piece kalabasa cubed<br>12 pieces okra<br>1 piece Chinese eggplant sliced<br>1 piece ampalaya sliced<br>1 piece kamote cubed (optional)<br>2 pieces tomato cubed<br>2 thumbs ginger crushed (optional)<br>1 piece onion chopped<br>4 cloves garlic crushed<br>2 teaspoons bagoong alamang<br>2 ½ cups water<br>3 tablespoons cooking oil<br>¼ teaspoon ground black pepper</div><br><div class='instructions'><h3>Instructions</h3><br>1. Heat cooking oil in a pot. Saute onion and garlic. Add ginger and continue to cook until the onion softens.<br>2. Add lechon kawali. Saute for 1 minute.<br>3. Pour water. Let boil.<br>4. Add Knorr Shrimp Cube. Cover the pot and cook in medium heat for 20 minutes.<br>5. Add tomato and bagoong alamang. Stir. Cover the pot. Cook for 3 minutes.<br>6. Put the kalabasa and kamote into the pot. Cook for 7 minutes.<br>7. Add sitaw, okra, ampalaya, and eggplant. Stir. Cover the pot and cook for 5 minutes.<br>8. Season with ground black pepper and add remaining lechon kawali. Cook for minutes.<br>9. Tranfer to a serving plate. Serve.</div><br><div class='nutritionalfacts'><br><h3>Nutrition Facts - Pinakbet</h3><br>1. Calories - 434.26kcal<br>2. Carbohydrates - 23.32g, Sugar - 8.87g, Fiber - 7.38g<br>3. Protein - 11.71g<br>4. Fat - 34.24g, Saturated Fat - 11.32g<br>5. Cholesterol - 83.57mg<br>6. Sodium - 168.94mg<br>7. Potassium - 1015.05mg<br>8. Vitamin A - 2103.79 IU<br>9. Vitamin C - 48.16mg<br>10. Calcium - 99.63mg<br>11. Iron - 1.87mg</div><br><div class='dietary'><br><h3>Dietary Recommendation</h3><br>After relishing pinakbet, balance your diet with lighter options. For breakfast, savor a bowl of champorado (chocolate rice porridge) topped with toasted pinipig (crisped rice) or a slice of ripe mango. For lunch, enjoy a mixed vegetable sinigang (sour soup) with shrimp or tofu, served with a side of steamed white rice. For dinner, opt for grilled fish served with a side of ensaladang talong (grilled eggplant salad) and a small portion of brown rice. Stay hydrated with water or fresh buko juice, and for a snack, enjoy sliced pineapple or watermelon for a refreshing treat.<br><br><a href='https://www.kawalingpinoy.com/pinakbet'>Nutrition facts source</a><br><a href='https://panlasangpinoy.com/pinakbet-tagalog-recipe-knr-sc'>Recipe and ingredients source</a></div>",
    "pizza":"<div class='ingredients'><h3>Ingredients</h3><br>2 1/2 cups flour<br>1 teaspoon salt<br>1 teaspoon sugar<br>1 tablespoon fast rise yeast<br>1 cup water (120*)<br>1 tablespoon oil<br>1/4 cup tomato sauce<br>1 teaspoon italian seasoning<br>1/2 teaspoon garlic powder<br>1/2 teaspoon salt<br>1/8 teaspoon pepper<br>1 1/2 cups pepperoni slices<br>1 cup shredded mozzarella cheese<br>1 cup shredded monterey jack cheese<br>3 tablespoons grated parmesan cheese</div><br><div class='instructions'><h3>Instructions</h3><br>1. In large bowl, mix first 4 ingredients.<br>2. Mix water and oil; add to flour mixture.<br>3. Turn onto floured surface; knead for 2 minutes.<br>4. Place in a greased bowl; turning to grease top.<br>5. Cover and let rise for 20 minutes.<br>6. Punch down; place on 12in, greased pizza pan.<br>7. Pat into a circle.<br>8. Topping: Mix first 5 ingredients and spread over crust.<br>9. Put a few pepperoni slices on top of sauce.<br>10. Sprinkle with 1/2 the mozzeralla; 1/2 the monterey jack, and 1/2 the parmesan.<br>11. Put the rest of the pepperoni on.<br>12. Repeat the cheese layer.<br>13. Bake at 400* for 20 minutes or until light brown.</div><br><div class='nutritionalfacts'><br><h3>Nutrition Facts - 1 Slice of Pizza</h3><br>1. Calories - 210kcal<br>2. Carbohydrates - 29.00g<br>3. Protein - 10g<br>4. Fat - 6g, Saturated Fat - 2.5g, Trans Fat - 0.1g<br>5. Cholesterol - 20mg<br>6. Sodium - 580mg</div><br><div class='dietary'><br><h3>Dietary Recommendation</h3><br>After indulging in pizza, balance your diet with lighter options. For breakfast, enjoy Greek yogurt with mixed berries and a sprinkle of granola. For lunch, opt for a colorful salad with grilled chicken, avocado, and a light vinaigrette dressing. For dinner, savor grilled salmon with roasted vegetables and a small portion of quinoa. Stay hydrated with water or herbal tea, and for a snack, enjoy apple slices with almond butter or a small handful of nuts.<br><br><a href='https://mobile.fatsecret.com/calories-nutrition/pizza-pizza/pepperoni-pizza'>Nutrition facts source</a><br><a href='https://www.food.com/recipe/easy-and-quick-homemade-pizza-22754'>Recipe and ingredients source</a></div>",
    "pork_adobo":"<div class='ingredients'><h3>Ingredients</h3><br>2 lbs pork belly (note 1)<br>2 tablespoons garlic (note 2)<br>5 dried bay leaves (note 3)<br>4 tablespoons vinegar (note 4)<br>1/2 cup soy sauce (note 5)<br>1 tablespoon peppercorn (note 6)<br>2 cups water<br>Salt to taste</div><br><div class='instructions'><h3>Instructions</h3><br>1. Combine the pork belly, soy sauce, and garlic then marinade for at least 1 hour<br>2. Heat the pot and put-in the marinated pork belly then cook for a few minutes<br>3. Pour remaining marinade including garlic.<br>4. Add water, whole pepper corn, and dried bay leaves then bring to a boil. Simmer for 40 minutes to 1 hour<br>5. Put-in the vinegar and simmer for 12 to 15 minutes<br>6. Add salt to taste<br>7. Serve hot.</div><br><div class='nutritionalfacts'><br><h3>Nutrition Facts - Pork Adobo</h3><br>1. Calories - 1211kcal<br>2. Carbohydrates - 5g, Fiber - 1g<br>3. Protein - 24g<br>4. Fat - 120g, Saturated Fat - 43g<br>5. Cholesterol - 163mg<br>6. Sodium - 1700mg<br>7. Potassium - 530mg<br>8. Vitamin A - 115 IU<br>9. Vitamin C - 2.5mg<br>10. Calcium - 50mg<br>11. Iron - 2.7mg</div><br><div class='dietary'><br><h3>Dietary Recommendation</h3><br>After relishing pork adobo, balance your diet with lighter options. For breakfast, savor a bowl of champorado (chocolate rice porridge) topped with toasted pinipig (crisped rice) or a slice of ripe mango. For lunch, enjoy a mixed vegetable sinigang (sour soup) with shrimp or tofu, served with a side of steamed white rice. For dinner, opt for grilled fish served with a side of ensaladang talong (grilled eggplant salad) and a small portion of brown rice. Stay hydrated with water or fresh buko juice, and for a snack, enjoy sliced pineapple or watermelon for a refreshing treat.<br><br><a href='https://panlasangpinoy.com/filipino-food-pork-adobo-recipe'>Source</a></div>",
    "pork_barbecue":"<div class='ingredients'><h3>Ingredients</h3><br>3 lbs. pork shoulder sliced into thin pieces<br>2 sachets Knorr SavorRich Pork Liquid Seasoning<br>2 tablespoons brown sugar<br>½ cup banana ketchup<br>3 pieces calamansi<br>6 cloves garlic crushed<br>½ cup soy sauce<br>½ teaspoon ground black pepper</div><br><div class='instructions'><h3>Instructions</h3><br>1. Arrange pork slices in a large bowl. Add Knorr SavorRich, soy sauce, ketchup, sugar, garlic, and ground black pepper. Mix well. Cover and refrigerate for at least 3 hours. Note: marinating the meat longer will provide better results.<br>2. Skewer the marinated meat on a bamboo skewer (also called barbecue stick). Set aside.<br>3. Heat-up the grill. Start to grill the pork barbecue for 3 to 5 minutes per side. Continue this step until pork is thoroughly cooked. Note: baste with a mixture of soy sauce, banana ketchup, and vegetable oil after turning the barbecue over.<br>4. Serve with warm rice and a dip of spicy vinegar.</div><br><div class='nutritionalfacts'><br><h3>Nutrition Facts - Pork Barbecue</h3><br>1. Calories - 2339kcal<br>2. Carbohydrates - 68g, Fiber - 2g<br>3. Protein - 281g<br>4. Fat - 98g, Saturated Fat - 34g<br>5. Cholesterol - 912mg<br>6. Sodium - 8612mg<br>7. Potassium - 5336mg<br>8. Vitamin A - 697 IU<br>9. Vitamin C - 22mg<br>10. Calcium - 285mg<br>11. Iron - 20mg</div><br><div class='dietary'><br><h3>Dietary Recommendation</h3><br>After enjoying pork barbecue, balance your diet with lighter options. For breakfast, opt for a vegetable omelette with whole grain toast and sliced tomatoes. For lunch, savor a mixed green salad with grilled chicken and a light vinaigrette dressing. For dinner, indulge in grilled fish with roasted vegetables and a small portion of quinoa. Stay hydrated with water or herbal tea, and for a snack, enjoy apple slices with almond butter or a small handful of nuts.<br><br><a href='https://panlasangpinoy.com/pork-barbecue'>Source</a></div>",
    "pork_sisig":"<div class='ingredients'><h3>Ingredients</h3><br>1 lb. pig ears<br>1 1/2 lb pork belly<br>1 piece onion minced<br>3 tablespoons soy sauce<br>1/4 teaspoon ground black pepper<br>1 knob ginger minced (optional)<br>3 tablespoons chili flakes<br>1/2 teaspoon garlic powder<br>1 piece lemon or 3 to 5 pieces calamansi<br>½ cup butter or margarine<br>¼ lb chicken liver<br>6 cups water<br>3 tablespoons mayonnaise<br>1/2 teaspoon salt<br>1 piece egg (optional)</div><br><div class='instructions'><h3>Instructions</h3><br>1. Pour the water in a pan and bring to a boil Add salt and pepper.<br>2. Put-in the pig's ears and pork belly then simmer for 40 minutes to 1 hour (or until tender).<br>3. Remove the boiled ingredients from the pot then drain excess water<br>4. Grill the boiled pig ears and pork belly until done<br>5. Chop the pig ears and pork belly into fine pieces<br>6. In a wide pan, melt the butter or margarine. Add the onions. Cook until onions are soft.<br>7. Put-in the ginger and cook for 2 minutes<br>8. Add the chicken liver. Crush the chicken liver while cooking it in the pan.<br>9. Add the chopped pig ears and pork belly. Cook for 10 to 12 minutes<br>10. Put-in the soy sauce, garlic powder, and chili. Mix well<br>11. Add salt and pepper to taste<br>12. Put-in the mayonnaise and mix with the other ingredients<br>13. Transfer to a serving plate. Top with chopped green onions and raw egg.<br>14. Serve hot. Share and Enjoy (add the lemon or calamansi before eating)</div><br><div class='nutritionalfacts'><br><h3>Nutrition Facts - Pork Sisig</h3><br>1. Calories - 1237kcal<br>2. Carbohydrates - 7g, Fiber - 1g<br>3. Protein - 40g<br>4. Fat - 46g, Saturated Fat - 38g, Polyunsaturated Fat - 11g, Monounsaturated Fat - 46g<br>5. Cholesterol - 220mg<br>6. Sodium - 1846mg<br>7. Potassium - 758mg<br>8. Vitamin A - 2068 IU<br>9. Vitamin C - 9mg<br>10. Calcium - 36mg<br>11. Iron - 3mg</div><br><div class='dietary'><br><h3>Dietary Recommendation</h3><br>After relishing pork sisig, balance your diet with lighter options. For breakfast, enjoy a bowl of lugaw (rice porridge) with slices of boiled egg and a dash of calamansi juice. For lunch, savor a mixed vegetable sinigang (sour soup) with shrimp or tofu, served with a side of steamed white rice. For dinner, opt for grilled fish served with a side of ensaladang talong (grilled eggplant salad) and a small portion of brown rice. Stay hydrated with water or fresh buko juice, and for a snack, enjoy sliced mango or pineapple for a refreshing treat.<br><br><a href='https://panlasangpinoy.com/pork-sisig'>Source</a></div>",
    "ramen":"<div class='ingredients'><h3>Ingredients</h3><br>2 large eggs<br>1 tablespoon olive oil<br>4 cloves garlic, minced<br>1 tablespoon freshly grated ginger<br>4 cups reduced sodium chicken broth<br>4 ounces shiitake mushrooms<br>1 tablespoon reduced sodium soy sauce<br>3 (5.6-ounce) packages refrigerated Yaki-Soba, seasoning sauce packets discarded*<br>3 cups baby spinach<br>8 slices Narutomaki, optional*<br>1 carrot, grated<br>2 green onions, thinly sliced</div><br><div class='instructions'><h3>Instructions</h3><br>1. Place eggs in a large saucepan and cover with cold water by 1 inch. Bring to a boil and cook for 1 minute. Cover eggs with a tight-fitting lid and remove from heat; set aside for 8-10 minutes. Drain well and let cool before peeling and halving.<br>2. Heat olive oil in a large stockpot or Dutch oven over medium heat. Add garlic and ginger, and cook, stirring frequently, until fragrant, about 1-2 minutes.<br>3. Whisk in chicken broth, mushrooms, soy sauce and 3 cups water.<br>4. Bring to a boil; reduce heat and simmer until mushrooms have softened, about 10 minutes. Stir in Yaki-Soba until loosened and cooked through, about 2-3 minutes.<br>5. Stir in spinach, Narutomaki, carrot and green onions until the spinach begins to wilt, about 2 minutes.<br>6. Serve immediately, garnished with eggs.</div><br><div class='nutritionalfacts'><br><h3>Nutrition Facts - Ramen</h3><br>1. Calories - 954kcal<br>2. Carbohydrates - 111g, Fiber - 6g, Sugars - 6.7g<br>3. Protein - 48g<br>4. Fat - 35g, Saturated Fat - 12g, Trans Fat - 0.5g, Polyunsaturated Fat - 6.3g, Monounsaturated Fat - 13g<br>5. Cholesterol - 227mg<br>6. Sodium - 2691mg<br>7. Potassium - 833.2mg<br>8. Vitamin D - 9.7mcg<br>9. Calcium - 124mg<br>10. Iron - 9.7mg</div><br><div class='dietary'><br><h3>Dietary Recommendation</h3><br>After indulging in ramen, balance your diet with lighter options. For breakfast, opt for a fruit smoothie with spinach, banana, and almond milk. For lunch, enjoy a mixed green salad with grilled chicken and a light vinaigrette dressing. For dinner, savor grilled salmon with roasted vegetables and a small portion of quinoa. Stay hydrated with water or herbal tea, and for a snack, enjoy apple slices with almond butter or a small handful of nuts.<br><br><a href='https://www.nutritionix.com/food/traditional-ramen'>Nutrition facts source</a><br><a href='https://damndelicious.net/2014/10/13/easy-homemade-ramen'>Recipe and ingredients source</a></div>",
    "shawarma":"<div class='ingredients'><h3>Ingredients</h3><br>1 tablespoon olive oil<br>1 pound beef top sirloin, thinly sliced<br>1 tablespoon shawarma seasoning<br>1 teaspoon ground allspice<br>½ teaspoon salt<br>½ cup tahini<br>3 tablespoons plain yogurt<br>½ lemon, juiced<br>½ teaspoon salt<br>1 (10 ounce) package large flour tortillas<br>2 tomatoes, halved and sliced<br>1 onion, thinly sliced</div><br><div class='instructions'><h3>Instructions</h3><br>1. Heat olive oil in a large skillet over medium heat. Add beef, shawarma seasoning, allspice, and 1/2 teaspoon salt; cook, turning occasionally, until beef is browned and tender, 3 to 5 minutes.<br>2. Whisk tahini, yogurt, lemon juice, and 1/2 teaspoon salt together in a small bowl until creamy.<br>3. Spread 1 to 2 tablespoons tahini sauce in the center of each tortilla. Divide beef slices, tomato slices, and onion slices evenly among tortillas. Roll up tortillas.<br>4. Preheat a panini press according to manufacturer's instructions. Press rolled tortillas seam side-down until grill marks appear, about 2 minutes. Cut each tortilla into 4 to 5 pieces.</div><br><div class='nutritionalfacts'><br><h3>Nutrition Facts - Shawarma (beef)</h3><br>1. Calories - 370kcal<br>2. Carbohydrates - 41g<br>3. Protein - 36.6g<br>4. Fat - 5.80g</div><br><div class='dietary'><br><h3>Dietary Recommendation</h3><br>After enjoying shawarma, balance your diet with lighter options. For breakfast, savor a bowl of oatmeal topped with sliced bananas and a sprinkle of cinnamon. For lunch, opt for a Greek salad with grilled chicken, cucumber, tomato, and feta cheese, dressed with olive oil and lemon juice. For dinner, indulge in grilled fish with roasted vegetables and a small portion of couscous. Stay hydrated with water or herbal tea, and for a snack, enjoy carrot sticks with hummus or a small handful of almonds.<br><br><a href='https://mobile.fatsecret.com/calories-nutrition/falafel-king/beef-shawarma'>Nutrition facts source</a><br><a href='https://www.allrecipes.com/recipe/259046/easy-beef-shawarma'>Recipe and ingredients source</a></div>",
    "sinigang":"<div class='ingredients'><h3>Ingredients</h3><br>2 lbs pork belly or buto-buto<br>1 bunch spinach or kang-kong<br>3 tablespoons fish sauce<br>12 pieces string beans sitaw, cut in 2 inch length<br>2 pieces tomato quartered<br>3 pieces chili or banana pepper<br>1 tablespoons cooking oil<br>2 quarts water<br>1 piece onion sliced<br>2 pieces taro gabi, quartered<br>1 pack sinigang mix good for 2 liters water</div><br><div class='instructions'><h3>Instructions</h3><br>1. Heat the pot and put-in the cooking oil<br>2. Sauté the onion until its layers separate from each other<br>3. Add the pork belly and cook until outer part turns light brown<br>4. Put-in the fish sauce and mix with the ingredients<br>5. Pour the water and bring to a boil<br>6. Add the taro and tomatoes then simmer for 40 minutes or until pork is tender<br>7. Put-in the sinigang mix and chili<br>8. Add the string beans (and other vegetables if there are any) and simmer for 5 to 8 minutes<br>9. Put-in the spinach, turn off the heat, and cover the pot. Let the spinach cook using the remaining heat in the pot.</div><br><div class='nutritionalfacts'><br><h3>Nutrition Facts - Sinigang</h3><br>1. Calories - 1538kcal<br>2. Carbohydrates - 91g, Fiber - 13g<br>3. Protein - 29g<br>4. Fat - 121g, Saturated Fat - 44g, Polyunsaturated Fat - 13g, Monounsaturated Fat - 56g<br>5. Cholesterol - 163mg<br>6. Sodium - 175mg<br>7. Potassium - 1838mg<br>8. Vitamin A - 2338 IU<br>9. Vitamin C - 58mg<br>10. Calcium - 225mg<br>11. Iron - 7mg</div><br><div class='dietary'><br><h3>Dietary Recommendation</h3><br>After relishing sinigang, balance your diet with lighter options. For breakfast, enjoy a bowl of champorado (chocolate rice porridge) topped with toasted pinipig (crisped rice) or a slice of ripe mango. For lunch, savor a mixed vegetable sinigang (sour soup) with shrimp or tofu, served with a side of steamed white rice. For dinner, opt for grilled fish served with a side of ensaladang talong (grilled eggplant salad) and a small portion of brown rice. Stay hydrated with water or fresh buko juice, and for a snack, enjoy sliced pineapple or watermelon for a refreshing treat.<br><br><a href='https://panlasangpinoy.com/pork-sinigang-na-baboy-recipe'>Source</a></div>",
    "siomai":"<div class='ingredients'><h3>Ingredients</h3><br>2 1/2 lbs ground pork<br>1 cup shrimp minced<br>2 sachets Knorr SavorRich Pork Seasoning 44g each<br>1 cup jicama minced<br>1 tablespoon sesame oil<br>1/4 teaspoon ground black pepper<br>1 cup onion minced<br>1 cup carrots minced<br>1 piece raw egg<br>1/2 cup scallions minced<br>30 pieces wonton wrapper<br>Water for steaming</div><br><div class='instructions'><h3>Instructions</h3><br>1. Combine ground pork and minced shrimp in a bowl. Gradually mix together.<br>2. Add jicama, carrot, onion, scallion, egg, ground black pepper, and sesame oil. Continue to mix until all the ingredients are well blended.<br>3. Add Knorr SavorRich Pork Liquid Seasoning. Mix well.<br>4. Scoop 1 1/2 tablespoons of the pork mixture and wrap in wonton wrapper (see video below for guidance). Perform this step until the mixture is fully consumed.<br>5. Arrange in a steamer and then steam for 15 to 20 minutes.<br>6. Transfer to a serving plate. Serve with toyo and calamansi dipping sauce and some chili garlic paste.</div><br><div class='nutritionalfacts'><br><h3>Nutrition Facts - Pork Siomai</h3><br>1. Calories - 574kcal<br>2. Carbohydrates - 10g, Fiber - 2g, Sugar - 3g<br>3. Protein - 34g<br>4. Fat - 43g, Saturated Fat - 15g, Polyunsaturated Fat - 5g, Monounsaturated Fat - 19g<br>5. Cholesterol - 164mg<br>6. Sodium - 163mg<br>7. Potassium - 723mg<br>8. Vitamin A - 3715 IU<br>9. Vitamin C - 11mg<br>10. Calcium - 58mg<br>11. Iron - 2mg</div><br><div class='dietary'><br><h3>Dietary Recommendation</h3><br>After indulging in siomai, balance your diet with lighter options. For breakfast, opt for a vegetable omelette with whole grain toast and sliced tomatoes. For lunch, enjoy a mixed green salad with grilled chicken and a light vinaigrette dressing. For dinner, savor grilled fish with roasted vegetables and a small portion of quinoa. Stay hydrated with water or herbal tea, and for a snack, enjoy apple slices with almond butter or a small handful of nuts.<br><br><a href='https://panlasangpinoy.com/pork-siomai-recipe'>Source</a></div>",
    "sushi":"<div class='ingredients'><h3>Ingredients</h3><br>1 ⅓ cups water<br>⅔ cup uncooked short-grain white rice<br>3 tablespoons rice vinegar<br>3 tablespoons white sugar<br>1 ½ teaspoons salt<br>4 sheets nori seaweed sheets<br>½ pound imitation crabmeat, flaked<br>1 avocado - peeled, pitted, and sliced<br>½ cucumber, peeled, cut into small strips<br>2 tablespoons pickled ginger</div><br><div class='instructions'><h3>Instructions</h3><br>1. Preheat the oven to 300 degrees F (150 degrees C).<br>2. Bring water to a boil in a medium pot; stir in rice. Reduce heat to medium-low, cover, and simmer until rice is tender and water has been absorbed, 20 to 25 minutes.<br>3. Mix rice vinegar, sugar, and salt in a small bowl. Gently stir into cooked rice in the pot and set aside.<br>4. Lay nori sheets on a baking sheet.<br>5. Heat nori in the preheated oven until warm, 1 to 2 minutes.<br>6. Center 1 nori sheet on a bamboo sushi mat. Use wet hands to spread a thin layer of rice on top. Arrange 1/4 of the crabmeat, avocado, cucumber, and pickled ginger over rice in a line down the center. Lift one end of the mat and roll it tightlyover filling to make a complete roll. Repeat with remaining ingredients.<br>7. Use a wet, sharp knife to cut each roll into 4 to 6 slices.</div><br><div class='nutritionalfacts'><br><h3>Nutrition Facts - Sushi</h3><br>1. Calories - 152kcal<br>2. Carbohydrates - 26g<br>3. Protein - 4g<br>4. Fat - 4g, Saturated Fat - 1g<br>5. Cholesterol - 6mg<br>6. Sodium - 703mg<br>7. Vitamin C - 3mg<br>8. Calcium - 12mg<br>9. Iron - 1mg<br>10. Potassium - 186mg</div><br><div class='dietary'><br><h3>Dietary Recommendation</h3><br>After indulging in sushi, balance your diet with lighter options. For breakfast, enjoy Greek yogurt with mixed berries and a sprinkle of granola. For lunch, opt for a colorful salad with grilled chicken, avocado, and a light vinaigrette dressing. For dinner, savor grilled salmon with roasted vegetables and a small portion of quinoa. Stay hydrated with water or herbal tea, and for a snack, enjoy apple slices with almond butter or a small handful of nuts.<br><br><a href='https://www.allrecipes.com/recipe/24228/sushi-roll'>Source</a></div>",
    "taho":"<div class='ingredients'><h3>Ingredients</h3><br>22 ounces soft silken tofu<br>3/4 cup sago pearls Note 1<br>4 1/2 cups water<br>3/4 cup brown sugar<br>3/4 cup water<br>1 teaspoon vanilla extract</div><br><div class='instructions'><h3>Instructions</h3><br>1. Pour 5 cups of water in a cooking pot and bring to a boil.<br>2. Add the sago pearls. Boil for 3 to 6 minutes. Reduce the heat to low setting, continue boiling for 5 to 10 minutes.<br>3. Drain the hot water by filtering the sago using a kitchen strainer. Put the sago pearls in a bowl with warm water and let it stay until needed.<br>4. Make the arnibal by boiling 3/4 cup water in a saucepan. Add the brown sugar. Stir. Add the vanilla extract. Turn the heat off. Set aside.<br>5. Transfer the extra soft tofu in a bowl. Microwave it for 2 1/2 minutes.<br>6. Arrange the soft tofu in individual cups. Top with sago pearls and pour arnibal (syrup) on top.</div><br><div class='nutritionalfacts'><br><h3>Nutrition Facts - Taho</h3><br>1. Calories - 605kcal<br>2. Carbohydrates - 114g, Fiber - 3g, Sugar - 89g<br>3. Protein - 4g<br>4. Fat - 9g, Saturated Fat - 1g<br>5. Sodium - 86mg<br>6. Potassium - 121mg<br>7. Vitamin C - 0.9mg<br>8. Calcium - 347mg<br>9. Iron - 3.2mg</div><br><div class='dietary'><br><h3>Dietary Recommendation</h3><br>After enjoying taho, balance your diet with lighter options. For breakfast, savor a bowl of oatmeal topped with sliced bananas and a sprinkle of cinnamon. For lunch, opt for a vegetable stir-fry with tofu and a side of brown rice. For dinner, indulge in grilled fish with steamed vegetables and a small portion of quinoa. Stay hydrated with water or herbal tea, and for a snack, enjoy apple slices with almond butter or a small handful of nuts.<br><br><a href='https://panlasangpinoy.com/filipino-street-food-homemade-taho-recipe'>Source</a></div>",
    "tapa":"<div class='ingredients'><h3>Ingredients</h3><br>1 1/2 lb beef sirloin thinly sliced<br>5 tablespoons soy sauce<br>3 tbsp minced garlic or 1 tablespoon garlic powder<br>2 tbsp sugar<br>1/4 teaspoon salt<br>1/4 teaspoon ground black pepper</div><br><div class='instructions'><h3>Instructions</h3><br>1. In a container, combine soy sauce, garlic, salt, pepper, and sugar and mix well. Set aside<br>2. Place the beef in the clear plastic bag<br>3. Pour-in the the mixed seasonings in the clear plastic bag with meat and mix well<br>4. Place inside the refrigerator and marinate for a minimum of 12 hours<br>5. In a pan, place 1 cup water and bring to a boil<br>6. Add 3 tbsp of cooking oil<br>7. Put-in the marinated beef tapa and cook until the water evaporates.</div><br><div class='nutritionalfacts'><br><h3>Nutrition Facts - Tapa</h3><br>1. Calories - 354kcal<br>2. Carbohydrates - 7g, Fiber - 1g, Sugar - 5g<br>3. Protein - 51g<br>4. Fat - 12g, Saturated Fat - 3g<br>5. Cholesterol - 6mg<br>6. Sodium - 1406mg<br>7. Potassium - 834mg<br>8. Vitamin C - 5mg<br>9. Calcium - 58mg<br>10. Iron - 5mg</div><br><div class='dietary'><br><h3>Dietary Recommendation</h3><br>After relishing tapa, balance your diet with lighter options. For breakfast, opt for a vegetable omelette with whole grain toast and sliced tomatoes. For lunch, enjoy a mixed green salad with grilled chicken and a light vinaigrette dressing. For dinner, savor grilled fish with roasted vegetables and a small portion of quinoa. Stay hydrated with water or herbal tea, and for a snack, enjoy apple slices with almond butter or a small handful of nuts.<br><br><a href='https://www.kawalingpinoy.com/filipino-beef-tapa'>Nutrition facts source</a><br><a href='https://panlasangpinoy.com/how-to-make-home-made-beef-tapa'>Recipe and ingredients source</a></div>",
    "tapsilog":"<div class='ingredients'><h3>Ingredients</h3><br>1 lb. beef sirloin sliced thinly<br>3 pieces eggs<br>6 tablespoons cooking oil<br>3 tablespoons Knorr Liquid Seasoning<br>6 cloves crushed garlic<br>¾ cups pineapple juice<br>2 tablespoons brown sugar<br>¼ teaspoon ground white pepper<br>5 cups leftover rice<br>1 teaspoon salt<br>5 cloves garlic crushed</div><br><div class='instructions'><h3>Instructions</h3><br>1. Prepare the tapa by placing the beef in a large bowl. Combine with all the tapa marinade ingredients. Mix well and cover the bowl. Place inside the fridge and marinate overnight.<br>2. Cook the garlic fried rice (sinangag na kanin) by heating 3 tablespoons cooking oil in a pan. Add crushed garlic. Cook until garlic turns light brown. Add the leftover rice. Stir-fry for 3 minutes.<br>3. Season with salt. Continue to stir-fry for 3 to 5 minutes. Set aside.<br>4. Start to cook the tapa. Heat a pan and pour the marinated beef into it, including the marinade. Add ¾ cups water. Let the mixture boil. Cover the pan and continue to cook until the liquid reduces to half. Add 3 tablespoons cooking oil into themixture. Continue to cook until the liquid completely evaporates. Fry the beef tapa in remaining oil until medium brown. Set aside.<br>5. Fry the egg by pouring 1 tablespoon oil on a pan. Crack a piece of egg and sprinkle enough salt on top. Cook for 30 seconds. Pour 2 tablespoons water on the side of the pan. Cover and let the water boil. Continue to cook until the egg yolks getscompletely cooked by the steam.<br>6. Arrange the beef tapa, sinangag, and fried egg on a large plate to form Tapsilog. Serve with vinegar as dipping sauce for tapa.</div><br><div class='nutritionalfacts'><br><h3>Nutrition Facts - Tapsilog</h3><br>1. Calories - 883kcal<br>2. Carbohydrates - 93g, Fiber - 3g, Sugar - 17g<br>3. Protein - 43g<br>4. Fat - 36g, Saturated Fat - 4g<br>5. Cholesterol - 86mg<br>6. Sodium - 2841mg<br>7. Potassium - 877mg<br>8. Vitamin C - 10.1mg<br>9. Vitamin A - 2500 IU<br>10. Calcium - 94mg<br>11. Iron - 4mg</div><br><div class='dietary'><br><h3>Dietary Recommendation</h3><br>After enjoying tapsilog, balance your diet with lighter options. For breakfast, savor a bowl of champorado (chocolate rice porridge) topped with toasted pinipig (crisped rice) or a slice of ripe mango. For lunch, enjoy a mixed vegetable sinigang (sour soup) with shrimp or tofu, served with a side of steamed white rice. For dinner, opt for grilled fish served with a side of ensaladang talong (grilled eggplant salad) and a small portion of brown rice. Stay hydrated with water or fresh buko juice, and for a snack, enjoy sliced pineapple or watermelon for a refreshing treat.<br><br><a href='https://panlasangpinoy.com/tapsilog-recipe'>Source</a></div>",
    "tinola":"<div class='ingredients'><h3>Ingredients</h3><br>2 lbs. chicken cut into serving pieces<br>1 cup malunggay leaves<br>1 cup hot pepper leaves<br>1/8 teaspoon ground black pepper<br>1 piece unripe papaya wedged<br>6 cups water<br>1 piece Knorr chicken cube<br>1 piece onion sliced<br>4 cloves garlic crushed and chopped<br>3 thumbs ginger julienne<br>2 tablespoons fish sauce patis<br>3 tablespoons vegetable oil</div><br><div class='instructions'><h3>Instructions</h3><br>1. Heat oil in a pot.<br>2. Sauté garlic, onion, and ginger. Add the ground black pepper.<br>3. When the onion starts to get soft, add the chicken. Cook for 5 minutes or until it turns light brown.<br>4. Pour the water. Let boil. Cover and then set the heat to low. Boil for 40 minutes.<br>5. Scoop and discard the scums and oil on the soup.<br>6. Add the Knorr chicken cube and chayote or papaya. Stir. Cover and cook for 5 minutes.<br>7. Put the malunggay and hot pepper leaves in the pot and pour the fish sauce in. Continue to cook for 2 minutes.<br>8. Transfer to a serving bowl. Serve.</div><br><div class='nutritionalfacts'><br><h3>Nutrition Facts - Tinola</h3><br>1. Calories - 21kcal<br>2. Carbohydrates - 4g, Sugar - 2g<br>3. Protein - 1g<br>4. Sodium - 1192mg<br>5. Potassium - 119mg<br>6. Vitamin C - 10.6mg<br>7. Vitamin A - 585 IU<br>8. Calcium - 26mg<br>9. Iron - 0.3mg</div><br><div class='dietary'><br><h3>Dietary Recommendation</h3><br>After relishing tinola, balance your diet with lighter options. For breakfast, opt for a fruit smoothie with spinach, banana, and almond milk. For lunch, enjoy a mixed green salad with grilled chicken and a light vinaigrette dressing. For dinner, savor grilled salmon with roasted vegetables and a small portion of quinoa. Stay hydrated with water or herbal tea, and for a snack, enjoy apple slices with almond butter or a small handful of nuts.<br><br><a href='https://panlasangpinoy.com/classic-tinolang-manok-recipe'>Source</a></div>",
    "tocino":"<div class='ingredients'><h3>Ingredients</h3><br>2 lbs. pork ham<br>1 1/2 tablespoons sea salt<br>1/2 teaspoon Prague powder #1<br>3/4 cups granulated white sugar<br>1 teaspoon sodium phosphate<br>1/4 cup anisette liquor<br>1/2 cup pineapple juice<br>1/4 cup crushed garlic<br>1 tablespoon garlic powder<br>1/4 teaspoon Vitamin C powder<br>1/4 teaspoon Red food coloring</div><br><div class='instructions'><h3>Instructions</h3><br>1. Slice the pork ham to about ¼ inch thickness<br>2. Dissolve the sodium phosphate in 5 tablespoons of water.<br>3. Except for the meat, combine all ingredients in a large bowl and mix well<br>4. Apply the combined mixture to the meat by rubbing. Make sure that the mixture is evenly distributed across the meat<br>5. Place the mixed ingredients in a covered container<br>6. Store the covered container (with meat and mixture) in room temperature for 14 hours. It may also be refrigerated but would take at least 3.5 days to complete.</div><br><div class='nutritionalfacts'><br><h3>Nutrition Facts - Pork Tocino</h3><br>1. Calories - 433kcal<br>2. Carbohydrates - 25.8g, Sugar - 25.3g<br>3. Protein - 26.6g<br>4. Fat - 24.8g, Saturated Fat - 9g<br>5. Cholesterol - 102mg<br>6. Sodium - 949mg<br>7. Potassium - 385mg<br>8. Vitamin C - 0.8mg<br>9. Calcium - 30mg<br>10. Iron - 1.6mg</div><br><div class='dietary'><br><h3>Dietary Recommendation</h3><br>After enjoying tocino, balance your diet with lighter options. For breakfast, opt for a vegetable omelette with whole grain toast and sliced tomatoes. For lunch, enjoy a mixed green salad with grilled chicken and a light vinaigrette dressing. For dinner, savor grilled fish with roasted vegetables and a small portion of quinoa. Stay hydrated with water or herbal tea, and for a snack, enjoy apple slices with almond butter or a small handful of nuts.<br><br><a href='https://www.kawalingpinoy.com/pork-tocino'>Nutrition facts source</a><br><a href='https://panlasangpinoy.com/homemade-pork-tocino-recipe'>Recipe and ingredients source</a></div>",
    "turon":"<div class='ingredients'><h3>Ingredients</h3><br>6 pieces bananas saba or plantains, cut in half (lengthwise)<br>1 cup jackfruit ripe, sliced<br>1 1/2 cup sugar<br>12 pieces lumpia wrapper<br>2 cups cooking oil</div><br><div class='instructions'><h3>Instructions</h3><br>1. Roll the banana on the sugar plate and ensure that the banana is coated with enough sugar<br>2. Place the banana with sugar coating in the spring roll wrapper and add some ripe jackfruit<br>3. Fold and lock the spring roll wrapper, use water to seal the edge<br>4. In a pan, heat the oil and put-in some sugar.Wait until the brown sugar floats<br>5. Put-in the wrapped banana and fry until the wrapper turns golden brown and the extra sugar sticks on wrapper<br>6. Serve hot as a dessert or snack. Share and Enjoy!</div><br><div class='nutritionalfacts'><br><h3>Nutrition Facts - Turon</h3><br>1. Calories - 292kcal<br>2. Carbohydrates - 58g, Sugar - 55g<br>3. Protein - 1g<br>4. Fat - 8g, Saturated Fat - 1g<br>5. Cholesterol - 1mg<br>6. Sodium - 13mg<br>7. Potassium - 123mg<br>8. Vitamin C - 3.8mg<br>9. Calcium - 7mg<br>10. Iron - 0.1mg</div><br><div class='dietary'><br><h3>Dietary Recommendation</h3><br>After indulging in turon, balance your diet with lighter options. For breakfast, enjoy a bowl of oatmeal topped with sliced bananas and a sprinkle of cinnamon. For lunch, opt for a vegetable stir-fry with tofu and a side of brown rice. For dinner, savor grilled fish with steamed vegetables and a small portion of quinoa. Stay hydrated with water or herbal tea, and for a snack, enjoy apple slices with almond butter or a small handful of nuts.<br><br><a href='https://panlasangpinoy.com/turon'>Source</a></div>",
    "waffles":"<div class='ingredients'><h3>Ingredients</h3><br>1 egg<br>225g self-raising flour<br>1 tbsp golden caster sugar (optional)<br>250ml milk<br>50g butter, melted and cooled<br>½ tsp vanilla extract (optional)<br>1 tbsp sunflower or vegetable oil<br>maple syrup and icing sugar, to serve (optional)</div><br><div class='instructions'><h3>Instructions</h3><br>1. Crack the egg (for fluffier waffles, use only the yolk at this stage) into a large bowl, then tip in the flour and a generous pinch of salt. Add the sugar, if using, then gradually whisk in the milk followed by the melted butter until smooth. Whiskin the vanilla, if using. If you've chosen to make fluffier waffles, whisk the egg white to soft peaks, then gently fold this into the batter. Alternatively, make the batter by blitzing all the ingredients together using a blender or hand blender.Can be made 1-2 hrs ahead and chilled.<br>2. Heat a waffle maker following the manufacturer's instructions, brush with a little of the oil, then ladle in enough batter to just cover the surface. Cook following the manufacturer's instructions (usually 5-6 mins) until the waffles are goldenbrown and crisp. Serve immediately or keep warm in a low oven while you make the rest. Drizzle with maple syrup or sprinkle with icing sugar, if you like.</div><br><div class='nutritionalfacts'><br><h3>Nutrition Facts - Waffles</h3><br>1. Calories - 267kcal<br>2. Carbohydrates - 34g, Sugar - 6g, Fiber - 2g<br>3. Protein - 6g<br>4. Fat - 12g, Saturated Fat - 6g<br>5. Cholesterol - 1mg<br>6. Sodium - 0.55g</div><br><div class='dietary'><br><h3>Dietary Recommendation</h3><br>After enjoying waffles, balance your diet with lighter options. For breakfast, savor Greek yogurt with mixed berries and a sprinkle of granola. For lunch, opt for a colorful salad with grilled chicken, avocado, and a light vinaigrette dressing. For dinner, indulge in grilled salmon with roasted vegetables and a small portion of quinoa. Stay hydrated with water or herbal tea, and for a snack, enjoy apple slices with almond butter or a small handful of nuts.<br><br><a href='https://www.bbcgoodfood.com/recipes/classic-waffles'>Source</a></div>"
}